[
  {
    "id": "12989547253",
    "author": "Adrian...415",
    "title": "One of the best apps but…",
    "content": "It saves sonic headache of having to manually divide up restaurant items buttttt I wish you can connect to Venmo. It has the option but it’s stuck on the Authorizing App screen:/ Besides that, great app",
    "rating": 4,
    "date": "2025-08-07T20:40:53-07:00"
  },
  {
    "id": "12971449892",
    "author": "3E-V",
    "title": "Amazing!!",
    "content": "Great app!! You should consider an option for splitting regular receipts like for Costco where it lists out the discounts per item nor just batched discount at the end",
    "rating": 5,
    "date": "2025-08-03T08:50:42-07:00"
  },
  {
    "id": "12967765248",
    "author": "Scrumpyfu",
    "title": "App doesn’t connect to Venmo",
    "content": "Lacking that ability makes this app totally useless.",
    "rating": 1,
    "date": "2025-08-02T09:57:06-07:00"
  },
  {
    "id": "12888944946",
    "author": "HateTab",
    "title": "Good idea but no functionality",
    "content": "Never able to load Venmo so what’s the point?",
    "rating": 1,
    "date": "2025-07-13T19:16:01-07:00"
  },
  {
    "id": "12869938546",
    "author": "TereF88",
    "title": "Super helpful",
    "content": "Great for when going out with friends and splitting the check",
    "rating": 5,
    "date": "2025-07-08T22:31:43-07:00"
  },
  {
    "id": "12837699090",
    "author": "Mitchell Motlagh",
    "title": "Great app",
    "content": "Simple and fast. No complaints.",
    "rating": 5,
    "date": "2025-06-30T20:44:50-07:00"
  },
  {
    "id": "12832705968",
    "author": "gagazola",
    "title": "i actually slapped the table when i found out you can split individual items",
    "content": "wow",
    "rating": 5,
    "date": "2025-06-29T14:04:21-07:00"
  },
  {
    "id": "12756744844",
    "author": "mercurialmommy",
    "title": "This app saves friendships",
    "content": "This app makes splitting bills not only easy but honestly super fun. The interface is so intuitive, and I love how tax and tip is distributed based on how much you spent proportionally. It makes venmoing/paying people back less awkward because you know exactly what you owe and only takes 3 minutes to do once you get your bill. You’ll never need to wait to be paid back ever again! Would LOVE if this app could sync with SplitWise too!!! Overall HIGHLY recommend!!!!!",
    "rating": 5,
    "date": "2025-06-09T21:37:26-07:00"
  },
  {
    "id": "12747223355",
    "author": "StarckNYC",
    "title": "Not recognizing receipt.",
    "content": "Doesn’t recognize a receipt after taking multiple photos or using an existing photo in my album. Needs to rework the receipt recognition.",
    "rating": 1,
    "date": "2025-06-07T10:03:52-07:00"
  },
  {
    "id": "12696957362",
    "author": "TTPD1022",
    "title": "Good concept but accuracy needs to improve",
    "content": "I tried this to split bills in a party of 5. Unfortunately, the app didn’t capture all the line items accurately. There were some that were mislabeled and some had incorrect amounts,",
    "rating": 3,
    "date": "2025-05-25T08:38:21-07:00"
  },
  {
    "id": "12694669264",
    "author": "Kort1975",
    "title": "So easy to use",
    "content": "Eating out with friends used to be stressful when the bill comes especially when you have a large party. With this app it’s so easy to use and calculate everything accurately.  I sent Venmo request everyone and it stress-free when it comes to splitting the bill.",
    "rating": 5,
    "date": "2025-05-24T18:32:07-07:00"
  },
  {
    "id": "12693919287",
    "author": "0011010000110010",
    "title": "USD only",
    "content": "Doesn’t support any other currency. Also twice now it’s miscalculated tab between parties so can’t trust it.",
    "rating": 1,
    "date": "2025-05-24T13:26:28-07:00"
  },
  {
    "id": "12633819304",
    "author": "Purpledaisy0327",
    "title": "Really Helpful",
    "content": "Splitting the bill has never been easier. I love the fact that you can take a photo of the bill and manually add in the tip. This has been such a game changer. It makes going out with people so much easier and hassle free and makes sure everyone pays correctly.",
    "rating": 5,
    "date": "2025-05-08T09:38:48-07:00"
  },
  {
    "id": "12620018647",
    "author": "AllisonannB",
    "title": "Splitting one item on bill between multiple people",
    "content": "I love the idea of this app, but the ease of it only works if people in the group don’t share any of the items on the bill. The app needs a feature where you can indicate that multiple people shared  appetizers for example. Right now you only have the option of putting the appetizer on one person’s bill which defeats the purpose of the app to me.",
    "rating": 3,
    "date": "2025-05-04T14:34:12-07:00"
  },
  {
    "id": "12619475551",
    "author": "Kisstel",
    "title": "Almost Perfect",
    "content": "I recently used the product and found it quite effective. However, there is one feature I wish were included: displaying the original item price alongside the divided amount. This addition would provide a clearer understanding of the overall breakdown and make it easier to assess the cost-sharing aspects. This enhancement could greatly benefit users who want more transparency and clarity in viewing pricing details. Overall, a great product, but this improvement would make it even better!",
    "rating": 4,
    "date": "2025-05-04T11:19:28-07:00"
  },
  {
    "id": "12612116796",
    "author": "Sgee34",
    "title": "WHY ARE BILLS ONLY EDITABLE FOR A WEEK? + NO CUSTOMER SUPPORT?",
    "content": "I spent over an hour creating and fixing bills for dinners with 13 people—only to find out later that I can’t edit bills a week after it’s created.. What’s the purpose of this limitation? People forget to pay and sometimes corrections are needed.\n\nI’ve emailed Tab multiple times and received no response. This app has potential, but needs better flexibility and actual customer support.",
    "rating": 3,
    "date": "2025-05-02T13:55:59-07:00"
  },
  {
    "id": "12604362839",
    "author": "Nisafeka",
    "title": "Needs to be more editable",
    "content": "I've had an issue with every receipt total not adding up to the correct amount. It needs more options to edit some of the prices on discounts, tax, tip, etc subcategories.",
    "rating": 3,
    "date": "2025-04-30T14:32:46-07:00"
  },
  {
    "id": "12571785617",
    "author": "Shrinath Shetty",
    "title": "Tax is being calculated wrongly",
    "content": "After importing all the details of the bill when the app is messing it up at the end getting incorrect tax details, it annoys me to no limit.",
    "rating": 1,
    "date": "2025-04-21T22:12:55-07:00"
  },
  {
    "id": "12566345342",
    "author": "Lo817",
    "title": "Absolutely Incredible",
    "content": "Makes splitting checks infinitely easier!! I use it all the time and now people want me to come to events because I can split the check most efficiently",
    "rating": 5,
    "date": "2025-04-20T10:20:11-07:00"
  },
  {
    "id": "12555626581",
    "author": "LK-2187",
    "title": "Functions ok, but needs work",
    "content": "This app is good but with a few added features, it could be great. For one, it only remembers one name. I generally go out to eat with the same group of people, so it would be nice if I could save multiple names, not just mine. It’s also frustrating that it doesn’t read screenshots at all. How is it the app can read a blurry, faded printed receipt with messy handwriting, but not a screenshot - specifically from DoorDash - that is clear as day? I don’t get it. \n\nFix those 2 things and it’ll be 5/5, without question.",
    "rating": 3,
    "date": "2025-04-17T16:34:22-07:00"
  },
  {
    "id": "12547135313",
    "author": "Mrshernandez13",
    "title": "Didn’t work",
    "content": "First time using the app and the tip was over $100 on a $24 bill. Could not find a way to cord t so I just deleted the app",
    "rating": 1,
    "date": "2025-04-15T11:42:05-07:00"
  },
  {
    "id": "12447834397",
    "author": "Charger Stone",
    "title": "Our Go-To Group Dining App",
    "content": "We tell everyone we know about this app. It has made dining out so easy. But PLEASE either add Venmo support or remove the option from your app. I’m tired of explaining that it doesn’t work to people we introduce it to.",
    "rating": 4,
    "date": "2025-03-21T13:34:35-07:00"
  },
  {
    "id": "12444822579",
    "author": "Ichristianr",
    "title": "Promising",
    "content": "Life in nyc go out with friends often. The app is promising but also buggy. Extremely irritating to get to the end of the process for the app to tell me gratuity is automatically added when it’s not, with no ability to modify.",
    "rating": 3,
    "date": "2025-03-20T19:05:47-07:00"
  },
  {
    "id": "12439946033",
    "author": "17120993",
    "title": "easy",
    "content": "just make sure you keep a photo of the itemized receipt",
    "rating": 5,
    "date": "2025-03-19T12:31:48-07:00"
  },
  {
    "id": "12439675327",
    "author": "Z1620482",
    "title": "Comma Doesn’t work",
    "content": "You can no longer put a comma when editing the prices. So the app is useless.",
    "rating": 1,
    "date": "2025-03-19T10:58:47-07:00"
  },
  {
    "id": "12428082140",
    "author": "Chazho",
    "title": "Great app!",
    "content": "This app appears to send a photo of the receipt up to a server, where the OCR work is done. In any case, the result is exceptionally good and accurate processing. \n\nThen it's very easy to assign amounts to individual people, allocating expenses separately for each person.\n\nTIP: To assign the cost of an item to people: 1. Select the person first (not the item). 2. Then select all items for which the person will pay some or all of the cost. 3. Select another person, and do the same. If multiple people are signed to the same item, the cost is automatically divided!\n\nThe app allows you to add additional items, correct misinterpreted ones, enter any discounts, as well as specifying the amount of sales tax and the percent of tip. \n\nIf the check is handwritten, or there is any other reason that you need to enter all the amounts yourself, you can skip the photo and OCR, and enter the numbers manually.\n\nIt's all very easy, and the user interface is well done. I contacted technical support with a potential problem, and their responsiveness was excellent.",
    "rating": 5,
    "date": "2025-03-16T09:33:55-07:00"
  },
  {
    "id": "12383166949",
    "author": "Ldricci3",
    "title": "P good",
    "content": "This app is confusing for drunk people after trivia but otherwise good",
    "rating": 5,
    "date": "2025-03-04T18:46:51-07:00"
  },
  {
    "id": "12279392377",
    "author": "Songbabe7",
    "title": "Travel lifesaver!!!",
    "content": "I travel with family frequently, and we like to split meals. This app lets me quickly calculate who owes what, without having to manually do the math!!!",
    "rating": 5,
    "date": "2025-02-06T14:05:39-07:00"
  },
  {
    "id": "12279215197",
    "author": "Apple app bozo",
    "title": "Venmo functionality",
    "content": "Unable to Connect to Venmo and use for direct payment to others using app.",
    "rating": 1,
    "date": "2025-02-06T12:59:44-07:00"
  },
  {
    "id": "12214712251",
    "author": "HailJebus",
    "title": "Awesome",
    "content": "So much better than most split apps",
    "rating": 5,
    "date": "2025-01-21T21:50:09-07:00"
  },
  {
    "id": "12211995676",
    "author": "MsSuzanne",
    "title": "Great app",
    "content": "Great app! I finally figured out how to delete the random “discount”. Found this app through my friends. You can edit tip.. add discount.. all of it. Love it!",
    "rating": 5,
    "date": "2025-01-21T07:04:40-07:00"
  },
  {
    "id": "12173939633",
    "author": "Mirza Rahman",
    "title": "Works great!",
    "content": "Been using it for years and is great for splitting annoying bills. My only feedback would be that it would be great if you specify quantity per user on items. All that said, this is amazing as a Free app and props to the developers for never pushing any ads. Would pay for this app tbh",
    "rating": 5,
    "date": "2025-01-11T20:10:09-07:00"
  },
  {
    "id": "12150106997",
    "author": "[Martimus]",
    "title": "Buggy, but has potential to work",
    "content": "I was not able to use the pay with Venmo feature. It would not connecting to my Venmo account.  Also, I was not able to enter my bill information correctly.  The option to add a manual tip and other text was displaying off the screen, and I could not select it. Ultimately, I went with another bill splitter app this time and it was a breeze.",
    "rating": 3,
    "date": "2025-01-05T17:47:57-07:00"
  },
  {
    "id": "12137589190",
    "author": "Matt Wuzz Up",
    "title": "One of the best apps that solves one of the worst problems",
    "content": "Great app! The ability to scan a check and it puts it all on the app and ready to divy up the tab!",
    "rating": 5,
    "date": "2025-01-02T16:11:45-07:00"
  },
  {
    "id": "12125960076",
    "author": "MargCarl456",
    "title": "Great app but wish it was more inclusive",
    "content": "I love this app and use it all the time and tell my friends to do the same. Unfortunately, my international friends cannot use this app because it is only available on the US App Store. Please expand who can use this app! ❤️",
    "rating": 4,
    "date": "2024-12-30T19:26:51-07:00"
  },
  {
    "id": "12098226499",
    "author": "Hoj Dawg Millionaire",
    "title": "Isn’t optimized for iPhone 16",
    "content": "Some of the manual edit elements can’t be clicked on the iPhone 16",
    "rating": 3,
    "date": "2024-12-23T15:30:36-07:00"
  },
  {
    "id": "12091135058",
    "author": "Zaataar",
    "title": "What I’ve been looking for!",
    "content": "I love this app! This is the perfect way to split a group dinner. I just take a picture of the receipt and pass my phone around the table for everyone to claim their dishes! And their birthday split feature and adjustable tip/tax and splitting dishes is amazing.",
    "rating": 5,
    "date": "2024-12-21T19:20:13-07:00"
  },
  {
    "id": "12040984445",
    "author": "Joe7291276292",
    "title": "Gotten much better",
    "content": "Still requires a double check that the scan worked, but when it does, it’s great!",
    "rating": 4,
    "date": "2024-12-08T11:06:05-07:00"
  },
  {
    "id": "12011663156",
    "author": "xMoKoLoKox",
    "title": "Great",
    "content": "Most useful app when splitting tabs",
    "rating": 5,
    "date": "2024-11-30T19:27:34-07:00"
  },
  {
    "id": "12005321248",
    "author": "Samiferjones",
    "title": "Doesn’t grab items",
    "content": "It’s great when it works but if it’s a receipt from like, the diner, it doesn’t read correctly.",
    "rating": 3,
    "date": "2024-11-29T06:37:45-07:00"
  },
  {
    "id": "11927771764",
    "author": "Turí L.",
    "title": "Great app! Great for friends and family",
    "content": "I have been using this app for close to a year now and it has been absolutely great! The ease of splitting the bill after just snapping a picture of the check is such a great idea. I’m surprised at how well it works. I have only had to edit my bill a few times in all of the number of times that I use it. \n\nI go out with my friends all the time and this is the easiest way to save time at the end without having to do the calculations of tax and tip for each person. The only things I wish were added is a slightly better UI and for the eventual Venmo connectivity which would be amazing. Developers, if you are reading this, great job and keep up the great work. If you have any questions or want any more feedback please reach out as I want to help this app be the best it can be.",
    "rating": 5,
    "date": "2024-11-08T13:25:58-07:00"
  },
  {
    "id": "11900782690",
    "author": "titi9464",
    "title": "Good app could be better",
    "content": "Great design just wish software was a bit better when importing info. Has still been a game changer for splitting bills and getting people to include tax/ tip with their Venmos lol",
    "rating": 4,
    "date": "2024-11-01T13:10:21-07:00"
  },
  {
    "id": "11822693480",
    "author": "AG.9519",
    "title": "While it's not a perfect app, it's entirely free to use.",
    "content": "While the app may have its quirks and occasionally require manual adjustments, it's overall a fantastic app. And the best part? It's completely free with no subscription fees.",
    "rating": 5,
    "date": "2024-10-11T11:36:53-07:00"
  },
  {
    "id": "11807777952",
    "author": "Hayley Pogue",
    "title": "I recommend this to all of my friends",
    "content": "Ever go to a dinner with a group of 4+ friends? Some people drink, some don’t? People got different meals at different price points? It is such a hassle to calculate what everyone owed to the brave soul who puts their card down. This app has changed that experience for me. I’m no longer nervous to put my card down because I know I can just use this app to calculate totals within 5 minutes. It does take some manual work (spot checking that the item costs are correct and verifying who ordered what) but I love this app so much. The only point for improvement is to have better receipt recognition!",
    "rating": 5,
    "date": "2024-10-07T07:49:18-07:00"
  },
  {
    "id": "11771845795",
    "author": "M-Tams",
    "title": "Works - Kind Of",
    "content": "The Venmo feature doesn’t work to connect Venmo. It would be cool if there was a feature that would allow you to mark who has already paid you (potential to even keep a running tab for friends that notoriously not pay). Any plans to add Zelle?",
    "rating": 3,
    "date": "2024-09-27T15:12:54-07:00"
  },
  {
    "id": "11742558254",
    "author": "Macattack021",
    "title": "Great App",
    "content": "Have loved this App so far and makes going out with friends so much easier! I feel more comfortable placing my card down knowing who precisely owes what.",
    "rating": 5,
    "date": "2024-09-19T15:35:05-07:00"
  },
  {
    "id": "11727817820",
    "author": "Impsguiggjykj",
    "title": "Solid",
    "content": "Not bad. It sometimes doesn’t know how to separate things from pictures but after checking over it, it’s ok. You review it and make edits if you have to but overall it’s been very useful.",
    "rating": 4,
    "date": "2024-09-15T11:40:51-07:00"
  },
  {
    "id": "11704726388",
    "author": "Sunberry9800",
    "title": "my favorite thing in the world",
    "content": "I love to collect credit card points and the best way to do it is with friend group dinners! the worst part is dividing it all up at the end of the night and making sure all the tax and tip are split evenly—I used to spend a decent time dissecting and calculating totals on my ipad but with the tab app my life is so much better!!! I tell all my friends to get it and they all love it (they call me the tab app influencer). pls never disappear from the app store!",
    "rating": 5,
    "date": "2024-09-08T22:36:47-07:00"
  },
  {
    "id": "11684971117",
    "author": "danielsircar",
    "title": "Venmo auth broken, good otherwise",
    "content": "Great calculator, but the Venmo auth screen takes me to two blank icons and a non-functioning button inside Venmo. Running latest version of both apps. Fix this and it’s golden",
    "rating": 4,
    "date": "2024-09-03T09:29:44-07:00"
  },
  {
    "id": "11627153659",
    "author": "_hannah_108_",
    "title": "bad bad",
    "content": "this app was so annoying to use so I switched to ChatGPT and it worked so much faster and accurate!",
    "rating": 1,
    "date": "2024-08-19T00:43:45-07:00"
  },
  {
    "id": "11622408424",
    "author": "swimgirl18",
    "title": "Love this app!",
    "content": "This app is so user friendly and easy to use. Makes splitting bills so much easier! Especially love the birthday feature",
    "rating": 5,
    "date": "2024-08-17T17:05:00-07:00"
  },
  {
    "id": "11614329603",
    "author": "Aimmiii",
    "title": "Venmo Option Not working",
    "content": "I like the app, it’s super easy to use and fast to translate the receipt after taking a picture/uploading. But the Venmo connection doesn’t work - I’ve had the app since Jan/Feb and have retired constantly. I still use the app in-spite of this due to the ease of use but Venmo connect was the main reason I downloaded this. So all I do now after divvying everything is screenshot and send to the group so they can send me the money - but would be more efficient to just request from the app like it is marketed to be able to.",
    "rating": 3,
    "date": "2024-08-15T13:58:38-07:00"
  },
  {
    "id": "11606074873",
    "author": "s@m1998h€rr",
    "title": "Why can’t I connect my venmo??",
    "content": "It’s a decent app for splitting, but me and my friends can never seem to connect our Venmo’s successfully. Wish they would fix that bug.",
    "rating": 3,
    "date": "2024-08-13T11:49:16-07:00"
  },
  {
    "id": "11588141344",
    "author": "Rosenvibes",
    "title": "Cool idea. Couldn't read the tax amount",
    "content": "It misread the tax amount and did not let me fix it.",
    "rating": 3,
    "date": "2024-08-08T16:38:01-07:00"
  },
  {
    "id": "11580350407",
    "author": "SHELLEY🐾🐾",
    "title": "Horrible, Math doesn’t add up @ all.",
    "content": "Took a photo added two things off receipt it added tax bill came out less than the tax amount doesn’t add up at all.",
    "rating": 1,
    "date": "2024-08-06T15:06:43-07:00"
  },
  {
    "id": "11580311717",
    "author": "Consumer Girlie",
    "title": "Quite buggy, decent receipt parsing",
    "content": "This app is both convenient and frustrating to use. Receipt parsing takes a lot of the effort out of bill splitting (👍) but it gets it parses items correctly maybe 70% of the time. Manually editing an item is not a huge pain, but the editing form is buggy and you have to backspace-delete and the whole text up to the point of a typo (selecting a single word in-place does not work for some reason).\n\nThe tip view is helpful but additional tips get reset if you reopen the app, altering the original total. \n\nSome issues with the bill drafting and sharing experience: \n\nYou can share a link to the bill in progress but if you don’t make an account the entire bill disappears when you reopen the app and you have to punch everything in again. This is odd because you can still “join” the bill again through the link after making an account, but can not go back to continue editing it.\n\nOverall this is an app that saves a lot of\ntime when it works well but wastes time when it does not.",
    "rating": 2,
    "date": "2024-08-06T14:50:33-07:00"
  },
  {
    "id": "11565856524",
    "author": "MadDog741",
    "title": "I never review apps!",
    "content": "I never review apps but I must for this one. This has got to be the best app I’ve downloaded on my iPhone ever. Being able to so easily spilt bills including tip and tax is amazing. And being able to say only a portion of the group shared an item is a game changer. I love it! Thank you!",
    "rating": 5,
    "date": "2024-08-02T19:48:04-07:00"
  },
  {
    "id": "11549061046",
    "author": "GodIsKingandQueen",
    "title": "Fantastic app",
    "content": "So many great features built into this app. I thoroughly enjoy it!",
    "rating": 5,
    "date": "2024-07-29T10:56:59-07:00"
  },
  {
    "id": "11533914279",
    "author": "kfelka",
    "title": "Best bill splitter there is!!!",
    "content": "Love this app, makes things so easy when dining with friends!",
    "rating": 5,
    "date": "2024-07-25T09:29:57-07:00"
  },
  {
    "id": "11516318350",
    "author": "that_asian_bean",
    "title": "Works Great!",
    "content": "Works Great!",
    "rating": 5,
    "date": "2024-07-20T17:46:47-07:00"
  },
  {
    "id": "11496295099",
    "author": "cbeans91",
    "title": "Is there a way to edit tax rate?",
    "content": "Great app except adjusting the tax rate doesn’t seem to be available. Tried to google for info but couldn’t find anything.",
    "rating": 4,
    "date": "2024-07-15T08:41:42-07:00"
  },
  {
    "id": "11487056003",
    "author": "Pappa Kapp",
    "title": "Great App - Needs a few more Features to be perfect",
    "content": "OCR recognition is on point. I love the divide and claim feature.\n\nI would like to kindly like to ask for the following:\n\n1. Undo Split feature\n2. Fix Connect to Venmo feature—this is not working and seems broken. :(\n2. Use QR code as “Share Code”",
    "rating": 4,
    "date": "2024-07-12T21:25:34-07:00"
  },
  {
    "id": "11474875464",
    "author": "MistrB01",
    "title": "Great Concept",
    "content": "This should be 5 stars for what it is supposed to do.  Works well on small bills.  It gets confused on larger bills with multiple taxes and/or subtotals.\n\nIt would be great if we could edit all items, add new items, and remove items.",
    "rating": 2,
    "date": "2024-07-09T17:09:29-07:00"
  },
  {
    "id": "11468262100",
    "author": "Duke the luke",
    "title": "Great",
    "content": "awesome app!! works great, makes splitting costs much easier",
    "rating": 5,
    "date": "2024-07-07T21:02:36-07:00"
  },
  {
    "id": "11466476970",
    "author": "Jesse OH",
    "title": "Tax",
    "content": "There’s no ability to add tax manually, it’s broken",
    "rating": 2,
    "date": "2024-07-07T08:42:04-07:00"
  },
  {
    "id": "11465493826",
    "author": "Agace3042",
    "title": "Easy to use",
    "content": "Love this app.  I now actually get paid back from my brother in law because I split the bill immediately so he can't \"forget\" to pay my husband back!",
    "rating": 5,
    "date": "2024-07-07T02:44:21-07:00"
  },
  {
    "id": "11449078035",
    "author": "E-Dez",
    "title": "Perfect app for dining out with friends",
    "content": "Easy to use gets the job done",
    "rating": 5,
    "date": "2024-07-02T10:40:01-07:00"
  },
  {
    "id": "11441867995",
    "author": "Mra.2002",
    "title": "Very useful!!",
    "content": "This app makes splitting the bill very easy. Snap a picture of the bill and in a few taps you’re able to see exactly how much everyone owes the person who put their card down. I love it!!",
    "rating": 5,
    "date": "2024-06-30T13:49:51-07:00"
  },
  {
    "id": "11438423102",
    "author": "dcff3677",
    "title": "Buggy",
    "content": "It's a good idea but the iOS app is buggy for bills you enter manually",
    "rating": 3,
    "date": "2024-06-29T16:29:11-07:00"
  },
  {
    "id": "11410672499",
    "author": "Stucks327",
    "title": "Tell all your friends",
    "content": "I love this app so much and it’s been a game changer going out with friends! It’s so easy to pass my phone around and have everyone claim what they ordered, even when there’s 10+ people. I have told a bunch of friends in the industry and they are also obsessed, making their lives easier. \nMy only complaints/requests are\n1. It’s not intuitive to get back into a check after you’re done with it and also how do I see the picture I took? \n2. A request for a feature (that I’m fairly certain doesn’t exist right now) so that a user can mark who paid? When trying to venmo after a few days, it’s difficult to remember who actually paid.",
    "rating": 4,
    "date": "2024-06-22T08:13:01-07:00"
  },
  {
    "id": "11383639125",
    "author": "Christian Joseph Grant",
    "title": "A great idea, poorly executed",
    "content": "I love the idea of this app - and if it worked properly it would be a lifesaver. However this app is terrible at itemizing items. I used a very clear photo of my receipt- the app included the “subtotal”, “tax”, and “total” amounts as line items that I then had to manually delete. Then, the app added a 58 dollar tip and I have no idea where they came from even after investigating my receipt. A 20% tip on our bill (which we left) was only ~20 dollars. \n\nThis app also does not let you edit the dollar amount of tax charged (in my case the app put it down as 0, which isn’t correct), which seems like a massive oversight. You should at least have the option to manually enter the amount of percentage of tax charged considering how bad the app is at itemizing. \n\nI am giving two stars, simply because the app DID itemize the actual items on my receipt correctly, with correct dollar amount and (close enough) names. With some manual override, I was about to get the bill within ~10 dollars of the actual amount paid - so in the end it can still be useful. This app has a lot of potential, it just needs a better algorithm at itemizing, and a manual override feature for the amount of tax paid.",
    "rating": 2,
    "date": "2024-06-15T03:49:14-07:00"
  },
  {
    "id": "11369420346",
    "author": "Bunny hats",
    "title": "Good idea",
    "content": "The app should be great but it’s not super good at reading bills nor does it allow me to\nInput decimals.",
    "rating": 2,
    "date": "2024-06-11T08:18:38-07:00"
  },
  {
    "id": "11365665078",
    "author": "komunculus",
    "title": "Bug when adding tax",
    "content": "There’s a bug where the tax calculation is the subtotal + tip, bringing the grand total >2x the subtotal.\n\nThe app didn’t have this issue before so this must be some new kind of bug",
    "rating": 1,
    "date": "2024-06-10T08:30:54-07:00"
  },
  {
    "id": "11333279659",
    "author": "craig_smith",
    "title": "This app is perfect",
    "content": "No notes.",
    "rating": 5,
    "date": "2024-06-01T19:11:02-07:00"
  },
  {
    "id": "11309061813",
    "author": "Dane review",
    "title": "Getting there",
    "content": "Why does it add all itemized items, and than also add the subtotal. Doubling the amount, think you have a bug. Also, you should have a currency or at minimum a way to multiple all lines by a currency percent.",
    "rating": 3,
    "date": "2024-05-26T05:29:40-07:00"
  },
  {
    "id": "11289283386",
    "author": "ShoMaria",
    "title": "Great tool but Venmo",
    "content": "Great tool for group to split the payment. However the Venmo doesn’t work",
    "rating": 4,
    "date": "2024-05-20T18:01:33-07:00"
  },
  {
    "id": "11260478137",
    "author": "Mferna12",
    "title": "Does the Job.",
    "content": "Does the job, but the interface is a little outdated. I also found it frustrating that I couldn’t delete when I selected someone paying me accidentally.",
    "rating": 3,
    "date": "2024-05-12T12:01:42-07:00"
  },
  {
    "id": "11260152981",
    "author": "Bahamuteos",
    "title": "Fantastic app, I just wish it would connect to Venmo",
    "content": "Even without a connection to Vimeo, it works great. It’s really transformed we going from being extremely anxious about splitting up large bills to make it quick and easy, a real game changer it has actual positive benefits in my life. Every time I try to connect to Venmo, it fails though.  Sending a text message works just fine though.",
    "rating": 5,
    "date": "2024-05-12T10:08:42-07:00"
  },
  {
    "id": "11244199936",
    "author": "Lottifish",
    "title": "Just what I was looking for!",
    "content": "I run a meetup group and splitting the bill with strangers is the worst! This makes it sooo easy! Just a quick pic of the receipt, assign each item to someone, and you’ve got the total for each person in 2 seconds! Then- I just give them the total and they can pay how they want. I just wish there was a quick way to mark each person off as having paid. But seriously- this is simple to use and just works!",
    "rating": 5,
    "date": "2024-05-07T23:04:09-07:00"
  },
  {
    "id": "11242486484",
    "author": "samthewall",
    "title": "So good",
    "content": "Finally I don’t have to subsidize my friends alcoholism",
    "rating": 5,
    "date": "2024-05-07T10:19:35-07:00"
  },
  {
    "id": "11237429607",
    "author": "QueenBee2HB",
    "title": "Great way to Divide a Group Bill",
    "content": "This app has been so helpful when it comes to dividing a large group bill. Simple & easy to use. For some reason the Venmo plug-in doesn’t work with this app at the moment, but that’s an easy enough work around. Game changer!",
    "rating": 5,
    "date": "2024-05-05T23:36:12-07:00"
  },
  {
    "id": "11235571047",
    "author": "AJDibb",
    "title": "Doesn’t Work",
    "content": "This is a great idea but it doesn’t work and if it does no one can figure out how to join or utilize",
    "rating": 1,
    "date": "2024-05-05T10:01:42-07:00"
  },
  {
    "id": "11224737167",
    "author": "Omar39024",
    "title": "Great app",
    "content": "Great app, super helpful. For some reason I haven’t been able to connect Venmo. It would be wonderful if this could be solved.",
    "rating": 4,
    "date": "2024-05-02T10:48:06-07:00"
  },
  {
    "id": "11219566615",
    "author": "300nk Rider",
    "title": "Pretty good",
    "content": "This app does the job and is accurate. The only thing is that the flash is annoying and I didn't see a way to disable it.",
    "rating": 4,
    "date": "2024-05-01T01:50:05-07:00"
  },
  {
    "id": "11210947459",
    "author": "bos-hater",
    "title": "Works great",
    "content": "Best app I have",
    "rating": 5,
    "date": "2024-04-28T13:37:37-07:00"
  },
  {
    "id": "11208658900",
    "author": "Kymmeeh",
    "title": "Awesome!",
    "content": "Been using this for years and so happy it’s got an update!! You take a photo of a big group receipt. You select who ordered what. If anyone split things it allows 2 people up to however many in the party! \n\nAt the end, it allows you to decide on the tip % and everyone gets a sub total with an itemized “receipt” if needed. \n\nI love that tabs are split fairly in large groups cuz then no one feels upset it wasn’t fair. Thanks for continuing to invest in the tab!",
    "rating": 5,
    "date": "2024-04-27T23:51:35-07:00"
  },
  {
    "id": "11199760474",
    "author": "xxtigeravatarxx",
    "title": "Am I doing this wrong?",
    "content": "Venmo has been “unavailable to connect” for the whole week I’ve had the app. That was pretty much my selling point on getting this app, so not sure if it’s user error or a bug. But if there is a work-around, I’d love to see a spot on the app with helpful tips for dealing with issues like this.",
    "rating": 2,
    "date": "2024-04-25T11:01:27-07:00"
  },
  {
    "id": "11174145084",
    "author": "alexdhad",
    "title": "helpful but needs several fixes",
    "content": "I like Tab a lot and use it often to split meals with groups. I’m surprised I hadn’t heard about it sooner!\n\nHowever, after using it for a couple months, I have realized there are several bugs that are super annoying to deal with. \n\n- Uploading a photo you’ve taken separately, instead of using the in-app camera to take a pic of the receipt, often results in incorrect tallying (by several hundred dollars). I then have to manually upload each item and its price instead. \n\n- When manually uploading, you for some reason can’t add tax? I have to add it as “additional tip.” \n\n- If your receipt name is too long, you can’t exit from the receipt. You have to restart the entire app to get back to the home page. \n\n- The most bizarre one: why can’t I use more than 5 letters to name someone? Please change this. \n\nThese fixes would make a HUGE difference in the usability of the app.",
    "rating": 3,
    "date": "2024-04-18T11:19:55-07:00"
  },
  {
    "id": "11167894112",
    "author": "imfoofy",
    "title": "Almost there",
    "content": "I actually use the app to split grocery receipts with my roommate moreso than for restaurants. UI could be vastly improved. Editing Bill Names, for example, can be a pain. If my bill name is too lengthy, I am unable to exit out of the bill to go back to my list of bills (so I end up having to force close the app and reopen). Another fix would be typing in general. If I need to edit the beginning of my text, I can move the cursor over to the spot I need but the moment I backspace or start typing, the cursor moves all the way back to the end & I am left having to delete the whole thing to restart and get it right the first time. Because my use case is a little different, I don’t need to have the tips auto set to 18% - if there’s a way to just have this default to zero instead, that’d be ideal.",
    "rating": 3,
    "date": "2024-04-16T22:16:59-07:00"
  },
  {
    "id": "11167818003",
    "author": "bluiflip",
    "title": "“Pre-Tip” Bug",
    "content": "This app is solid but please fix the (un editable) pre-tip bug that added roughly $500 to to $122 group bill. This bug/glitch currently makes the app useless at the moment.",
    "rating": 1,
    "date": "2024-04-16T21:46:49-07:00"
  },
  {
    "id": "11153232438",
    "author": "YzyMetalGirl",
    "title": "Cuentas claras",
    "content": "The best app to keep your friends! Cuentas claras!! Amistades durareras!!!",
    "rating": 5,
    "date": "2024-04-13T05:59:36-07:00"
  },
  {
    "id": "11144730622",
    "author": "Brit the G",
    "title": "Dedicated user",
    "content": "I highly recommend this app. Super useful when splitting a bill. Especially at any group dinner. It totals the items individually as well as tax and tip. Easy and quick. I will be keeping this app for sure.",
    "rating": 4,
    "date": "2024-04-10T21:24:36-07:00"
  },
  {
    "id": "11122634713",
    "author": "Crazykill3r",
    "title": "Best App for Sharing Food",
    "content": "Its the greatest app ive used in order to\nSplit bills even with plates that were shared",
    "rating": 5,
    "date": "2024-04-04T18:58:18-07:00"
  },
  {
    "id": "11073560584",
    "author": "Jarell132",
    "title": "Great for group dining",
    "content": "This app is awesome! It can be a bit clunky with larger/longer receipts but still works very well! If you dine with large parties often this helps!",
    "rating": 5,
    "date": "2024-03-22T12:07:47-07:00"
  },
  {
    "id": "11059769885",
    "author": "AlexSubscriber",
    "title": "Amazing app",
    "content": "My friends and I all use this, totally saves time",
    "rating": 5,
    "date": "2024-03-18T15:57:22-07:00"
  },
  {
    "id": "11039586140",
    "author": "Little Red Riding Hood 666",
    "title": "Doesn’t work",
    "content": "Can’t even connect account to Venmo.",
    "rating": 1,
    "date": "2024-03-13T04:25:02-07:00"
  },
  {
    "id": "11037094603",
    "author": "wafow",
    "title": "Fantastic App",
    "content": "The app is super user friendly and work amazingly. This makes splitting bills soooo much easier. Now no one loses out when one person puts their card down and everyone tries to Venmo them the correct amount.",
    "rating": 5,
    "date": "2024-03-12T10:10:58-07:00"
  },
  {
    "id": "11030840001",
    "author": "donot trap",
    "title": "Great app",
    "content": "Would love to see better naming conventions for each bill.  Also it takes few tries to get the scanning to work correctly",
    "rating": 4,
    "date": "2024-03-10T15:27:53-07:00"
  },
  {
    "id": "11030579850",
    "author": "Galaxium",
    "title": "Shamefully bad.",
    "content": "Dodge this bill splitting app. Poor UI and UX. Impossible to edit values. Uninstalled.",
    "rating": 1,
    "date": "2024-03-10T13:42:31-07:00"
  },
  {
    "id": "11026038445",
    "author": "Peter mares",
    "title": "Great app, bad UI / Venmo integration",
    "content": "The app does what it says and makes it easy. \n\nThe Venmo integration is a key reason I downloaded it, and it hasn’t worked since I got the app. \n\nThe UI is very odd. I think it’s trying to be super modern, but the buttons are impossible to click, at least on my iPhone. I’ll click close 10 times before it registers.",
    "rating": 3,
    "date": "2024-03-09T08:50:25-07:00"
  },
  {
    "id": "11024038995",
    "author": "jamaicaj",
    "title": "Venmo connect has never worked",
    "content": "This app has great potential but ever since I’ve downloaded this app the Venmo connection has never worked.",
    "rating": 2,
    "date": "2024-03-08T20:50:16-07:00"
  },
  {
    "id": "11016945996",
    "author": "JKJA1",
    "title": "The best thing",
    "content": "This is then best thing that ever happened to me . So easy to use with no back and forth computation , complications and disagreements. Here is my part of the bill . Bye! Yaaaay",
    "rating": 5,
    "date": "2024-03-06T21:19:22-07:00"
  },
  {
    "id": "10987467328",
    "author": "OriginalGumshoe",
    "title": "Wow and wow!!",
    "content": "I have used similar bill splitting apps in the past but this is light years ahead of everything!  I am so impressed!  It would be nice to have MORE integration with other payment tools other than Venmo AND allow each person to use a different form of payment.  Also, include an ‘expensing’ option so that if work is reimbursing the meal, you can exclude items they do not allow (eg. alcohol, etc).  Great programming!!",
    "rating": 5,
    "date": "2024-02-27T20:23:16-07:00"
  },
  {
    "id": "10962699783",
    "author": "hummusqueso",
    "title": "Venmo?",
    "content": "This app is so much more intuitive than Splitwise but its Venmo integration has been broken for a very long time, which makes it hard to recommend to people. Is there a plan to fix this? Is this app in active development? Bill-splitting is such a common problem, it’s baffling our options for it are so lackluster. Hope you resolve this soon.",
    "rating": 3,
    "date": "2024-02-21T00:38:28-07:00"
  },
  {
    "id": "10953956873",
    "author": "Kathy S. Over 50",
    "title": "Fast and Efficient!",
    "content": "Fast and efficient way to cover only your share!  No more uneasiness or guesswork.",
    "rating": 5,
    "date": "2024-02-18T13:23:08-07:00"
  },
  {
    "id": "10945467037",
    "author": "the-sun-king",
    "title": "Brilliant Execution",
    "content": "Excellent app. OCR is top-notch and each step of the process is easy to use and easy to edit. The ability to split individual items amongst multiple people is easy and super useful. Couldn't recommend more!",
    "rating": 5,
    "date": "2024-02-16T07:53:58-07:00"
  },
  {
    "id": "10925588825",
    "author": "parada31",
    "title": "Amazing App for Group Dinners",
    "content": "Amazing app, makes it very simple and easy to split the bill and has some neat stuff added on! \n\nHoping for the Venmo connection to be fixed soon!",
    "rating": 5,
    "date": "2024-02-10T19:29:54-07:00"
  },
  {
    "id": "10925192712",
    "author": "leslietualla",
    "title": "Reliable & Easy",
    "content": "This app has takes away the hassle of having to split bills. So easy to use.",
    "rating": 5,
    "date": "2024-02-10T16:43:18-07:00"
  },
  {
    "id": "10925178717",
    "author": "Maddkell",
    "title": "Lifesaver",
    "content": "Highly recommend!!",
    "rating": 5,
    "date": "2024-02-10T16:37:16-07:00"
  },
  {
    "id": "10919412235",
    "author": "ALoveKing",
    "title": "USD only??",
    "content": "If there is a way to switch currencies, it’s not obvious to me. Would be great to have this included in an update. Otherwise I love the ease and conscience of this app!",
    "rating": 4,
    "date": "2024-02-09T04:35:17-07:00"
  },
  {
    "id": "10903056519",
    "author": "Rueben Dorado",
    "title": "It’s great",
    "content": "This app makes it so easy for me to split bills for restaurants to grocery bills it is a very convenient tool for me",
    "rating": 5,
    "date": "2024-02-04T19:08:28-07:00"
  },
  {
    "id": "10898448421",
    "author": "The Alt Vault",
    "title": "Broken Venmo Connection - Still Great",
    "content": "Amazing app that I have loved for years BUT it has never connected to Venmo. I would seriously love for that to be fixed and for another integration to be added with Splitwise- that would be amazing",
    "rating": 4,
    "date": "2024-02-03T14:41:35-07:00"
  },
  {
    "id": "10887863933",
    "author": "AppleNinjaPie",
    "title": "Everyone needs this app",
    "content": "It’s freaking amazing",
    "rating": 5,
    "date": "2024-02-01T00:39:49-07:00"
  },
  {
    "id": "10853164695",
    "author": "HEP2123",
    "title": "Venmo won’t connect",
    "content": "Great for the most part, except Venmo won’t connect to the app. It just leads me to a blank screen with two circles and two buttons, but clicking the “allow” button doesn’t do anything.",
    "rating": 3,
    "date": "2024-01-22T17:46:19-07:00"
  },
  {
    "id": "10853096112",
    "author": "CynthiaCar",
    "title": "could be better",
    "content": "i might need to find a better app for this sorta thing. the auto complete from a photo is suuuuper hit or miss. mostly misses if i’m honest to where it’s easier to manually enter it in. even then. at the end i can’t change the tax amount on my own which is annoying. it also doesn’t make it easy to split the tip evenly. it splits the tip based of percentage per amount spend which is fine… if i wanted to do that.",
    "rating": 2,
    "date": "2024-01-22T17:18:47-07:00"
  },
  {
    "id": "10833152680",
    "author": "anonymous honest review",
    "title": "Venmo never connects",
    "content": "Ever since I downloaded the app, it keeps telling me that venmo is “temporarily” not available. Temporarily in this case means always. If you can’t make it work, why are you setting the expectations that there is a possibility to connect to venmo?",
    "rating": 2,
    "date": "2024-01-17T11:17:37-07:00"
  },
  {
    "id": "10818289051",
    "author": "Romance_geek",
    "title": "Best App",
    "content": "I use the app frequently with friends and it never fails!",
    "rating": 5,
    "date": "2024-01-13T11:21:46-07:00"
  },
  {
    "id": "10781113649",
    "author": "Jaymenaomi",
    "title": "Love it!! So helpful!",
    "content": "I have used this app for over 10 yrs and I absolutely love it. My friends always tell me to use it when we go out and it makes life so much easier. Thank you! Thank you! Thank you!",
    "rating": 5,
    "date": "2024-01-03T18:09:47-07:00"
  },
  {
    "id": "10778744192",
    "author": "Tab-restaurant tax rate",
    "title": "Is there a setting to change the tax rate?",
    "content": "I don’t think tax is always 18% it could vary.",
    "rating": 5,
    "date": "2024-01-03T05:13:06-07:00"
  },
  {
    "id": "10758775410",
    "author": "Tab NL",
    "title": "Needs work",
    "content": "When I take a picture, it’s not accurate",
    "rating": 3,
    "date": "2023-12-29T05:44:29-07:00"
  },
  {
    "id": "10733221434",
    "author": "Innocent Sin",
    "title": "Great but one issue never fixed",
    "content": "Love the app. It makes splitting receipts  quick and easy. however, I have this issue with the short character limit for names, and another issue is that if the app gets the name of an item wrong on the receipt, it doesn’t allow me to change it for some reason I’m not able to delete any of the characters to fix the name. I’ve had this problem for the longest time, but they’ve never seem to fix it",
    "rating": 3,
    "date": "2023-12-22T17:43:07-07:00"
  },
  {
    "id": "10705955911",
    "author": "Blaxa",
    "title": "Where has this app been?",
    "content": "We just tried this today to split a bill for 12 people among 4 people. Everyone was impressed! Love that this really solves an everyday kind of situation! However, it mentioned an \"unclaimed amount\" and we had no way to easily see which item it was so I just ate up that cost. Also, I couldn't see a way to see the capture of the actual bill to confirm some things.",
    "rating": 4,
    "date": "2023-12-16T20:35:01-07:00"
  },
  {
    "id": "10691324047",
    "author": "Mcnuggs",
    "title": "Awesome!",
    "content": "Wish this app was around back when I was younger and went out in large groups.  Super convenient!",
    "rating": 5,
    "date": "2023-12-13T14:22:55-07:00"
  },
  {
    "id": "10676223589",
    "author": "claudbdnd",
    "title": "Easy to use!",
    "content": "Súper user friendly perfect for splitting checks. Always recommend to everyone I know",
    "rating": 5,
    "date": "2023-12-09T15:38:31-07:00"
  },
  {
    "id": "10654804291",
    "author": "UserReviewer000",
    "title": "Venmo doesn’t work",
    "content": "The whole reason I downloaded this app is because it advertised simple Venmo support so I wouldn’t have to manually request everyone. However this option still does not work after months and there seems to be no motivation to make it work.",
    "rating": 1,
    "date": "2023-12-03T17:04:11-07:00"
  },
  {
    "id": "10621169777",
    "author": "iPatxx",
    "title": "Inability to manually change tax amount.",
    "content": "Incorrect tax amount without the ability to change it. My receipt lists tax as $1.54 but the app keeps trying to charge $4.62. There’s no way to manually change it either, just the tip amount.",
    "rating": 1,
    "date": "2023-11-24T12:58:38-07:00"
  },
  {
    "id": "10620749362",
    "author": "KezG.",
    "title": "Looking for something like this",
    "content": "I do bulk grocery shopping with friends and family. Im looking for an easy way to snap a picture of bill , select who’s expense and it tally up the cost.\nThis is almost what I need but geared more towards splitting restaurant bills.\nIt would be nice if there was an option to select what type of bill you want to split and also  if the members /names can be saved. Overall a great concept and easy to use",
    "rating": 4,
    "date": "2023-11-24T10:26:09-07:00"
  },
  {
    "id": "10596905788",
    "author": "Omarblu",
    "title": "Needs work",
    "content": "Love the concept of the app but it always gets confused when adding the subtotals and tips. It’ll have a random crazy price that’s no where near what we your bill is. It should allow us to manually make changes to the taxes and tips portion of the bill",
    "rating": 2,
    "date": "2023-11-17T19:02:09-07:00"
  },
  {
    "id": "10590267384",
    "author": "claire_1239399",
    "title": "Wish venmo integration worked",
    "content": "Would be perfect if that happened!",
    "rating": 3,
    "date": "2023-11-15T20:27:44-07:00"
  },
  {
    "id": "10585043266",
    "author": "Musichameleon",
    "title": "Simple app! A must for anybody under the age of 40!",
    "content": "Easy to use interface, and somehow now makes picking up the tab, and dividing later, not an enormous chore.",
    "rating": 5,
    "date": "2023-11-14T07:31:18-07:00"
  },
  {
    "id": "10581811916",
    "author": "Dariusssssssss1",
    "title": "This app is awesome",
    "content": "Love the app!! Overall a 4.9/5 for me, there were certain parts of the process that weren’t so obvious at first but could easily be figured out by revisiting. For example, The item assignment for claiming bill items. Upon arriving at the final page to pay, I realized items were unclaimed as it wasn’t entirely obvious in the moment. Finding a way to make it obvious the first iteration would be awesome, but that’s a difficult design question.\n\nOther aspects were related to the Venmo integration having issues, but that’s prob just a backend integration issue.",
    "rating": 5,
    "date": "2023-11-13T08:10:03-07:00"
  },
  {
    "id": "10579303329",
    "author": "joeenguyenn",
    "title": "Potential but not good enough",
    "content": "This could’ve been the best app ever but the fact that you take the subtotal before tax and add the tip percentage and THEN you add tax is stupid. the tax should be before the tip.",
    "rating": 2,
    "date": "2023-11-12T14:01:18-07:00"
  },
  {
    "id": "10549764817",
    "author": "Joao1405",
    "title": "Photo gallery issues",
    "content": "Great interface and easy to navigate, but there are serious issues with pulling a receipt photo from your gallery and reading it.",
    "rating": 2,
    "date": "2023-11-04T09:36:53-07:00"
  },
  {
    "id": "10499289786",
    "author": "jschwartz830",
    "title": "Works well",
    "content": "Intuitive interface. Great for splitting bills.",
    "rating": 5,
    "date": "2023-10-21T06:12:55-07:00"
  },
  {
    "id": "10475197129",
    "author": "tylerfire55",
    "title": "Please Fix Integration!",
    "content": "The app is great. I haven't had any issues with adding amounts or food items, and it seems very intuitive most of the time too, but we need the Venmo integration back ASAP!",
    "rating": 3,
    "date": "2023-10-14T15:09:28-07:00"
  },
  {
    "id": "10459944123",
    "author": "Jobieg2012",
    "title": "Downloaded this not knowing it would be a true game changer!!",
    "content": "This app is very easy to use once you understand what clicking on certain things does. It made splitting a large bill with family so super easy! I am obsessed. Will be sharing with friends and family from now on. Working in restaurant industry has made me really appreciate how this functions.",
    "rating": 5,
    "date": "2023-10-10T10:50:05-07:00"
  },
  {
    "id": "10449417911",
    "author": "Flowingrace",
    "title": "Better than all other bill splitting apps",
    "content": "I recently was asked to try Plates when I was out with a party of 13. The app is pretty, but when it comes to functionality and splitting checks, Tab is the best. Take a photo and it will automatically note all of the dishes and $$. I love that you can add people to the bill, not just random plates (looking at you Plates). Would highly recommend Tab to anyone going out with large parties where you need to split the check 😎",
    "rating": 5,
    "date": "2023-10-07T10:21:50-07:00"
  },
  {
    "id": "10431111777",
    "author": "Jadricj",
    "title": "Taxes",
    "content": "I’m not able to add the taxes",
    "rating": 2,
    "date": "2023-10-02T09:16:03-07:00"
  },
  {
    "id": "10404529077",
    "author": "Rosentrotter",
    "title": "This app is a must have",
    "content": "Rarely do I write reviews. This app has likely saved me money (of me missing a few dollars/cents trying to figure out this math on my own) and so many headaches splitting bills of large groups at restaurants that do not want to take the time to do separate checks. \n\nOver time, I have actually found it easier to just use this app rather than asking the server to do separate checks. In my experience with Tab, if you’re willing to do the work of figuring out who got what yourself, your servers get the order right, your food comes quicker (since they don’t have to spend a long time at the computer typing everything in carefully), and it makes the experience for the group better as a whole. \n\nA few feature suggestions:\n\nAppetizers: A conversation that tends to come up when deciding who got what is “well this person are more of this than this person.” Can you create a way to say “this person had 4 of 12 items from this” instead of splitting it 12 ways and tapping it four times? Technically the app does this, but it requires a bit of extra taps. \n\nAlcohol: Guests may feel it’s appropriate to tip more for elaborate cocktails than they would for a pizza. Servers also tip out the bartender. Is there a way to figure out how to skew tips up based on how much of the bill was alcohol? For example, 15% for the food, 20% for the alcohol.",
    "rating": 5,
    "date": "2023-09-24T21:42:04-07:00"
  },
  {
    "id": "10404359229",
    "author": "Kenz123454321",
    "title": "THIS IS EXACTLY WHAT I NEEDED!!",
    "content": "So so so cool!!! So useful and everyone needs this! Put the bill on one persons card and EASILY Venmo the exact amount of your meal!",
    "rating": 5,
    "date": "2023-09-24T20:13:35-07:00"
  },
  {
    "id": "10399298696",
    "author": "th3druminator",
    "title": "Used to be great",
    "content": "I love tab but it no longer works with Venmo so it’s not as useful as it used to be.",
    "rating": 2,
    "date": "2023-09-23T10:06:30-07:00"
  },
  {
    "id": "10392511648",
    "author": "hoobla",
    "title": "Does not work",
    "content": "Adding incorrectly, total always wrong",
    "rating": 1,
    "date": "2023-09-21T12:02:06-07:00"
  },
  {
    "id": "10377522528",
    "author": "Shar therapies",
    "title": "Venmo Connection No Good",
    "content": "The Venmo connection options doesn’t work",
    "rating": 2,
    "date": "2023-09-17T04:40:03-07:00"
  },
  {
    "id": "10368895476",
    "author": "Ordered wings",
    "title": "Perfect",
    "content": "Does exactly what it needs to do quickly",
    "rating": 5,
    "date": "2023-09-14T16:36:46-07:00"
  },
  {
    "id": "10359668813",
    "author": "Bevsastar",
    "title": "Amazing! And perfect for big parties!!",
    "content": "Love!",
    "rating": 5,
    "date": "2023-09-11T22:23:28-07:00"
  },
  {
    "id": "10349169213",
    "author": "kjc9three",
    "title": "Meh",
    "content": "Would be better if you could enter the tax in manually. Would often times get the numbers wrong when uploading a bill",
    "rating": 3,
    "date": "2023-09-08T22:30:05-07:00"
  },
  {
    "id": "10338686595",
    "author": "NippleLion",
    "title": "Perfect",
    "content": "Works great! But I would say that the tip should be easier to change. Maybe like a dial? Sometimes the photo doesn’t capture all the elements but it’s easy to edit. Thanks for this app!",
    "rating": 5,
    "date": "2023-09-05T20:35:09-07:00"
  },
  {
    "id": "10335423425",
    "author": "ploddingonby",
    "title": "Doesn’t work as advertised",
    "content": "The venmo integration doesn’t work",
    "rating": 1,
    "date": "2023-09-04T21:19:11-07:00"
  },
  {
    "id": "10295703057",
    "author": "Ramirez1523",
    "title": "Amazing! Absolutely great when going out with friends!",
    "content": "Save us so much time with the bill, I just wish they would incorporate Zelle in the request and send like they do with Venmo",
    "rating": 5,
    "date": "2023-08-24T16:16:03-07:00"
  },
  {
    "id": "10281868220",
    "author": "Domini123",
    "title": "Helpful app for splitting the bill",
    "content": "Really useful to calculate everyone’s total including tip and taxes",
    "rating": 5,
    "date": "2023-08-20T20:27:43-07:00"
  },
  {
    "id": "10281646421",
    "author": "CrimeObssessedAsf",
    "title": "Can’t even connect to Venmo",
    "content": "What good is an app if the features aren’t fully functional?",
    "rating": 1,
    "date": "2023-08-20T18:53:17-07:00"
  },
  {
    "id": "10277066145",
    "author": "kyawzazaw",
    "title": "Great app",
    "content": "Can you make it so that certain items can be split?",
    "rating": 5,
    "date": "2023-08-19T12:04:48-07:00"
  },
  {
    "id": "10274681209",
    "author": "Vasu2021",
    "title": "Need to do the math",
    "content": "Just came from a dinner with friends. I realized the software didn’t pickup the tax and tip clearly mentioned in the bill. I ended up paying the tax and tip for 8 people!",
    "rating": 2,
    "date": "2023-08-18T21:27:53-07:00"
  },
  {
    "id": "10220981050",
    "author": "picklesssssssssss",
    "title": "My go to for settling tabs",
    "content": "It does all the things I want it to do!",
    "rating": 5,
    "date": "2023-08-04T20:24:15-07:00"
  },
  {
    "id": "10136989207",
    "author": "Gimme CC Points",
    "title": "Your big group is now your server’s favorite table",
    "content": "If you love going out to eat with friends and being your server’s favorite table by asking for one check - this is the app for you.\n\nTake a picture of the itemized check, take note of what you tipped and that’s all you need. This has made group trips and big dinners out a breeze, so you can grab those CC points without worrying about getting stuck with any extra beyond what your share is!",
    "rating": 5,
    "date": "2023-07-13T13:45:20-07:00"
  },
  {
    "id": "10130367092",
    "author": "Szjg3223332",
    "title": "Perfect",
    "content": "I cover everyone’s bill and reap the cc points with this 🙌🏽",
    "rating": 5,
    "date": "2023-07-11T19:18:12-07:00"
  },
  {
    "id": "10129001319",
    "author": "kingdrockula",
    "title": "Way too many steps for a simple bill",
    "content": "So where the Plates app is too simple and constrained, Tab is far too complex for a simple bill. I have to first scan the receipt (which doesn’t always go well). Then I have to manually type each diner’s name. Then I have to enter each line item with both a price and a name (or correct the OCR from the picture). It’s like a full 5 minutes for a single lunch bill. Oh but wait, the stupid Tax line doesn’t work, so I have to record tax as a “second tip.”\n\nThen I can finally calculate what each person owed. It’s insane how many steps this is for a single meal. At this point, I might as well keep using the Excel spreadsheet I wrote with formulas for splitting tax and tip.",
    "rating": 2,
    "date": "2023-07-11T09:57:10-07:00"
  },
  {
    "id": "10117767341",
    "author": "Meeeshmosh",
    "title": "Great but a little glitchy",
    "content": "Doesn’t work well with longer receipts, but otherwise really really helpful app",
    "rating": 3,
    "date": "2023-07-08T08:36:02-07:00"
  },
  {
    "id": "10107227666",
    "author": "Dan the bike man",
    "title": "Best check split app",
    "content": "I never leave app reviews, but this app is so good that I had to write one. I go out to eat with friends often and this has helped sort out the mess of the check better than any other app I’ve tried. It does all the math for you no matter how complicated the check gets. Everyone should use this.",
    "rating": 5,
    "date": "2023-07-05T10:26:55-07:00"
  },
  {
    "id": "10005276734",
    "author": "blessed be the fruit",
    "title": "Hard to Edit Photo Captured Bills",
    "content": "The instructions are clear; however the app is a little buggy. I had several items that had parentheses on the original bill and once imported through the camera, the items’ names for some reason cannot be properly edited. I couldn’t delete the words of the name that were attributed to the wrong line items. I had to delete the items, with the dollar amounts, completely and manually input them back again; at which point, I just decided to go back using an Excel sheet because what’s the point.",
    "rating": 2,
    "date": "2023-06-06T06:48:55-07:00"
  },
  {
    "id": "9994848425",
    "author": "Ndjfjfjrn",
    "title": "Great but missing a key feature",
    "content": "This app makes Bill splitting almost effortless the only problem I have is that there is no way to split a item amongst the people who are involved with that item. If this feature would be installed it would make this app almost perfect in my opinion.",
    "rating": 4,
    "date": "2023-06-03T06:25:43-07:00"
  },
  {
    "id": "9993061020",
    "author": "Southernblueblood",
    "title": "Obsessed.",
    "content": "I love this app. It makes life so simple and perfect.",
    "rating": 5,
    "date": "2023-06-02T17:50:29-07:00"
  },
  {
    "id": "9987580264",
    "author": "Josh Kimbly",
    "title": "Must have app!",
    "content": "This App is absolutely the easiest and quickest way to split your bills amongst a group.",
    "rating": 5,
    "date": "2023-06-01T05:39:31-07:00"
  },
  {
    "id": "9987572234",
    "author": "DSBay",
    "title": "Don’t look any further",
    "content": "MUST HAVE This App. The best App to use for easy breakdown of your checks at a restaurant. Makes the whole process simplistic. Our waitress was even happy to hear they didn’t have to split the checks.",
    "rating": 5,
    "date": "2023-06-01T05:36:50-07:00"
  },
  {
    "id": "9951831840",
    "author": "tae79hyun",
    "title": "Great app!",
    "content": "Finally! This is essential when going out with a big group of friends and need to split the “tab”.",
    "rating": 5,
    "date": "2023-05-21T15:28:12-07:00"
  },
  {
    "id": "9951292206",
    "author": "shvnzz",
    "title": "not connecting to Venmo",
    "content": "defeats the purpose of the app if you can’t connect to venmo!",
    "rating": 1,
    "date": "2023-05-21T11:32:38-07:00"
  },
  {
    "id": "9938407917",
    "author": "BeatlesFan017",
    "title": "Stopped Working",
    "content": "While the tab scanning has been fixed as of May 2023, the app no longer supports Venmo. I’d love if you could fix it, otherwise, I’d give 5 stars!",
    "rating": 4,
    "date": "2023-05-17T20:57:07-07:00"
  },
  {
    "id": "9923770292",
    "author": "grA.V",
    "title": "Trash",
    "content": "Counted my receipt twice, one total showed as a single unassigned item, no way to remove or edit once initial allocation made. Swiping doesn’t work. Deleted app.",
    "rating": 1,
    "date": "2023-05-13T13:42:22-07:00"
  },
  {
    "id": "9897235470",
    "author": "celnicc",
    "title": "App keeps crashing",
    "content": "Tab used to be my best party trick! Every time I’ve used Tab recently, it crashes. There’s no way for me to snap a pic, process an old picture or anything without this app crashing. Hopefully it gets better?",
    "rating": 2,
    "date": "2023-05-05T20:24:47-07:00"
  },
  {
    "id": "9892523098",
    "author": "mrRandom4yew",
    "title": "Garbage",
    "content": "Can’t even read a simple receipt accurately",
    "rating": 1,
    "date": "2023-05-04T11:01:26-07:00"
  },
  {
    "id": "9862131236",
    "author": "JustAnAvgRunner",
    "title": "Crashes always when importing a pic from library",
    "content": "Always crashes when selecting an image from library to use for the receipt",
    "rating": 1,
    "date": "2023-04-25T23:22:10-07:00"
  },
  {
    "id": "9860278353",
    "author": "Wordophile",
    "title": "Annoying, slow interface. Bad bill scanning.",
    "content": "I appreciate Tab for being free, but there are some UX hurdles still. Points for trying to be radically simple, I guess, but just make sure the app handles the exact kind of bill splitting you need. \n\n Also, their OCR is rough—I wanted to split a receipt from Square (in literal black and white, from my email) and it still read it wrong. So be sure to double check the bill scanning! \n\nIt’s important to get the scan right because editing the bill reading is very painful to do. \n\n Anyway, I have faith they can improve over time, but it’s still a long way to go :-/\n\n[edited for tone, given the context of the developer response below]",
    "rating": 3,
    "date": "2023-04-25T09:50:47-07:00"
  },
  {
    "id": "9860014751",
    "author": "Md60605",
    "title": "Cannot connect to Venmo",
    "content": "Every attempt results in message saying unable to connect to Venmo, making this app unusable.",
    "rating": 1,
    "date": "2023-04-25T08:23:23-07:00"
  },
  {
    "id": "9829808724",
    "author": "sunshine_sunset_123",
    "title": "Never loads",
    "content": "This app is terrible it NEVER loads so you constantly lose your bill and have to start over",
    "rating": 1,
    "date": "2023-04-16T16:41:53-07:00"
  },
  {
    "id": "9807849234",
    "author": "That bih hanuh",
    "title": "Many tech issues",
    "content": "Can’t add multiple pictures for large tabs, it won’t save the bill. I’ve done this 4 times and had to recreate my huge bill every time. What’s the point? Also won’t connect to venmo",
    "rating": 1,
    "date": "2023-04-10T11:51:24-07:00"
  },
  {
    "id": "9768598704",
    "author": "baybaybayalex",
    "title": "Great App",
    "content": "Saves me so much time and it’s accurate.",
    "rating": 5,
    "date": "2023-03-30T10:20:53-07:00"
  },
  {
    "id": "9765503303",
    "author": "Traveler2715",
    "title": "Best bill split app in the market",
    "content": "Better than any paid bill split apps.",
    "rating": 5,
    "date": "2023-03-29T12:47:44-07:00"
  },
  {
    "id": "9750177141",
    "author": "Pharod",
    "title": "Amazing idea but execution could be better",
    "content": "I spent a few hours trying to find an app that can snap and OCR receipts. Tab was the only one I’ve found and it looked very promising. \nUnfortunately for my specific use case it didn’t work out well, but I still believe it’s a great app. \n\nA few notes for devs, hope this could be useful:\n\n- Since my checks are in foreign language I have to translate these using Google Translate and save image of translated receipts. Luckily Tab can use receipt image! Unfortunately it’s OCR capability seems to be limited, it can’t handle these translated receipts well, even text actually look nice and sharp. Probably just need better OCR library. \n- Somewhere closer to final step it tells me that $23 is not distributed. I expect a shortcut here to let me quickly fix this. It’s not here. Also on a step where items are marked it could do better job showing issues like not assigned items. \n- Not all receipts are in USD, people in other countries use other currencies 😏",
    "rating": 4,
    "date": "2023-03-25T05:42:47-07:00"
  },
  {
    "id": "9735825220",
    "author": "JessBellPell",
    "title": "Can’t connect to Venmo",
    "content": "Venmo won’t connect.",
    "rating": 1,
    "date": "2023-03-21T00:51:58-07:00"
  },
  {
    "id": "9724346979",
    "author": "UrbanStudiesGeek",
    "title": "Use this not Splitwise",
    "content": "Intuitive and helpful app! I don’t understand why it’s not more popular",
    "rating": 5,
    "date": "2023-03-17T17:15:01-07:00"
  },
  {
    "id": "9702161794",
    "author": "100sue",
    "title": "Love but…",
    "content": "Please fix Venmo or add other options, no ability to cut and paste the breakdown in text, doesn’t save bills even if I press the save button.",
    "rating": 4,
    "date": "2023-03-11T06:00:49-07:00"
  },
  {
    "id": "9642304639",
    "author": "Ricanlambda",
    "title": "Awesome idea but fix the payment options",
    "content": "Fix the Venmo option! Most of the time is unavailable. Also, add ApplePay or some other option since the Venmo integration is not reliable.",
    "rating": 3,
    "date": "2023-02-21T19:38:34-07:00"
  },
  {
    "id": "9635218279",
    "author": "Eric O'Brien",
    "title": "Amazing when it works",
    "content": "I love this app so much, its just struggling a little bit. Trying to pull up “my bills” takes forever and the circle just spins and spins. I also wish it had a “friend” feature for people you regularly split the bill with to become friends with. Finally, i wish there was a better recap that can be texted out to everyone to show people their own itemized receipt.",
    "rating": 3,
    "date": "2023-02-19T15:05:34-07:00"
  },
  {
    "id": "9634529797",
    "author": "Dancing and Smiling",
    "title": "Incredibly frustrating",
    "content": "Doesn’t store bills for even a week, so when I went on a trip with friends and we entered bills as we went, by the end of the trip we couldn’t even tally our costs because the app had deleted past bills. Loads slowly, and one of our members couldn’t even ever create an account. Bad design, bad interface, bad app. Stick to Splitwise, it’s so much better.",
    "rating": 1,
    "date": "2023-02-19T10:04:17-07:00"
  },
  {
    "id": "9621415752",
    "author": "Obliviga",
    "title": "A couple of bugs that make me want to uninstall the app",
    "content": "1. Unable to add tax\n2. Additional tip erases when navigating the pages of the bill",
    "rating": 1,
    "date": "2023-02-15T14:33:49-07:00"
  },
  {
    "id": "9607761723",
    "author": "Luvahorsey",
    "title": "Good if everything already calculated",
    "content": "If you just want to split everything that’s already as printed, like a restaurant bill, it’s good. \n\nIf you’re trying to apply a specific tax percentage to figure out how much someone owes you for footing the bill, it’s not worth.\n\nYou can only change the dollar amount for the tax, not the actual percentage.\n\nFor example, on the receipt it says the calculated dollar amount over the subtotal. This app asks you to enter that specifically.\n\nYou can’t change the tax percentage to determine what that amount is in app. You would have to do that separately and comeback to in put it. For each person.\n\nAt that point you might as well just do the rest of the calculations on your own.",
    "rating": 3,
    "date": "2023-02-11T12:40:56-07:00"
  },
  {
    "id": "9604752420",
    "author": "Danmjacks",
    "title": "Great App",
    "content": "Love the app, but there is an issue on newer phones where part of the view is being covered up by the other phone’s top notch. This makes it difficult to tap buttons",
    "rating": 4,
    "date": "2023-02-10T17:46:12-07:00"
  },
  {
    "id": "9603902133",
    "author": "tirthgp",
    "title": "Just what I needed",
    "content": "Has exactly what I need to split bill. I wish it directed you to Venmo without other people’s integration though.",
    "rating": 5,
    "date": "2023-02-10T11:32:44-07:00"
  },
  {
    "id": "9588348870",
    "author": "Bon.Vivant",
    "title": "Life made easy 😍",
    "content": "Giving 4/5 stars for the simplicity of the interface and intuitive bill splitting.\n\nThe app needs to be updated to account for the dynamic island in newer iPhones (14 Pro). The share / next options etc are not positioned well.",
    "rating": 4,
    "date": "2023-02-05T21:51:28-07:00"
  },
  {
    "id": "9587358557",
    "author": "neurotwit",
    "title": "So close!",
    "content": "The OCR and splitting worked pretty well.  It missed the tax and no way to correct it.  Venmo integration didn't work.",
    "rating": 4,
    "date": "2023-02-05T14:14:18-07:00"
  },
  {
    "id": "9586783324",
    "author": "bbyy0da",
    "title": "Unable to process receipt",
    "content": "Every time I upload a receipt or take a photo of it, it would say there’s an error and to try again. I always have to manually enter it, which is annoying. If it worked well, it would have 5 stars.",
    "rating": 2,
    "date": "2023-02-05T10:23:28-07:00"
  },
  {
    "id": "9579879539",
    "author": "Iamthecold",
    "title": "Really could be special",
    "content": "Works great but needs venmo to work, keeps saying it is unavailable.",
    "rating": 3,
    "date": "2023-02-03T14:20:18-07:00"
  },
  {
    "id": "9561706914",
    "author": "EverydayAstronaut",
    "title": "Great!",
    "content": "Love this app! Ability to scan in bills is such a nice feature. Only thing— currently the bills don’t save after you finish them (even tho app gives confirmation that bills will be saved),\n\nFeature request: make the ability to have a “full page” screen shot (makes a really long scrollable screen shot, built in feature for iPhone if content is flagged correctly I believe), then I could send friends the breakdown much easier.",
    "rating": 4,
    "date": "2023-01-29T14:49:04-07:00"
  },
  {
    "id": "9560078219",
    "author": "WOLFIDX",
    "title": "Easy & Simple to Use",
    "content": "Best Split Bill App, You can add & edit Tax/Tip. Very Useful!",
    "rating": 5,
    "date": "2023-01-29T05:17:13-07:00"
  },
  {
    "id": "9553993292",
    "author": "Rudy Ballesteros",
    "title": "Great app",
    "content": "Best app I have used to split bills, has some bugs. But works great most the time.",
    "rating": 5,
    "date": "2023-01-27T13:36:40-07:00"
  },
  {
    "id": "9526821344",
    "author": "876rtfuida2312465tfcfcfgdrsytf",
    "title": "11/10",
    "content": "Such a good app. Makes splitting the bill so easy, and no stress, and everyone leaves happy knowing they paid their fair share. Quite possibly one of the best apps on the App Store.",
    "rating": 5,
    "date": "2023-01-19T23:41:31-07:00"
  },
  {
    "id": "9479821451",
    "author": "EricJMendez",
    "title": "Nothing Beats This",
    "content": "I love using this app. It’s so easy and impresses everyone, each time I pull it out. Makes splitting the bill very easy with bug groups.",
    "rating": 5,
    "date": "2023-01-06T19:19:24-07:00"
  },
  {
    "id": "9463467999",
    "author": "KumaHuman",
    "title": "Literally a lifesaver",
    "content": "10/10 easy to use and has EVERYTHING I need",
    "rating": 5,
    "date": "2023-01-02T11:25:22-07:00"
  },
  {
    "id": "9459346221",
    "author": "kodymullins",
    "title": "Top 5 apps in all of America",
    "content": "My letter to whoever the developers are - THANK YOU for saving me endless headaches and mind numbing attempts to split the bill.\n\nAmazing.",
    "rating": 5,
    "date": "2023-01-01T09:29:23-07:00"
  },
  {
    "id": "9453514561",
    "author": "Chuckles McGee",
    "title": "The best",
    "content": "Simply the best",
    "rating": 5,
    "date": "2022-12-30T18:59:31-07:00"
  },
  {
    "id": "9417039138",
    "author": "mmqne",
    "title": "Versatile and easy to understand",
    "content": "Unlike other bill splitting apps, this one allows you to edit the numbers yourself in addition to automatically calculating them by default. For instance you can edit the tax and tip precisely instead of just using a percentage. Great app!",
    "rating": 5,
    "date": "2022-12-20T10:34:13-07:00"
  },
  {
    "id": "9414157868",
    "author": "jota_eh",
    "title": "Essential App to install",
    "content": "This App is a must have if you often need to split the check.\n\nHappy to see that the “upload image” button bug has been fixed. Would give this App 5 stars if there weren’t lingering layout issues.\n\nThe UI needs refining but the App does its job extremely well. One of the firsts App I make sure to install on a new iPhone.",
    "rating": 4,
    "date": "2022-12-19T14:51:48-07:00"
  },
  {
    "id": "9407943859",
    "author": "RFF3D",
    "title": "The best sp/it",
    "content": "⭐️⭐️⭐️⭐️⭐️",
    "rating": 5,
    "date": "2022-12-17T19:44:59-07:00"
  },
  {
    "id": "9400732789",
    "author": "DQD123",
    "title": "It’s fantastic when it works",
    "content": "Definitely a great app, but it doesn’t work 100% every time, it picks up other numbers on the receipt from time to time depending on the receipt.",
    "rating": 3,
    "date": "2022-12-15T19:20:25-07:00"
  },
  {
    "id": "9396130657",
    "author": "SubParBurrito",
    "title": "Can’t actually connect Venmo",
    "content": "When I try to connect Venmo it’s say”Venmo is temporarily unavailable “",
    "rating": 3,
    "date": "2022-12-14T11:09:49-07:00"
  },
  {
    "id": "9378491232",
    "author": "ceelabits",
    "title": "One of my favorite apps",
    "content": "I don’t review apps often so this is a special occasion. Tab is the best app for spliting any bill or receipt, not only for restaurants. I’ve used it to divide up groceries as well. I like that the interface is very simple, though some features are a little unintuitive at first (like swiping for item edit/delete).",
    "rating": 5,
    "date": "2022-12-09T12:08:50-07:00"
  },
  {
    "id": "9368220694",
    "author": "annawoz",
    "title": "This app is trash",
    "content": "When manually inputting a bill, unable to edit tax and tip after you’ve input them. Went through the whole manual bill input process only to find out the final page is unresponsive and there’s no way to split the bill on people’s behalf?? Fix your bugs. This is bare minimum functionality.",
    "rating": 1,
    "date": "2022-12-06T14:15:43-07:00"
  },
  {
    "id": "9357046636",
    "author": "Jt968",
    "title": "Game changer!",
    "content": "Really like how intuitive it is",
    "rating": 5,
    "date": "2022-12-03T10:44:56-07:00"
  },
  {
    "id": "9335755985",
    "author": "Dan Zab",
    "title": "Great APP",
    "content": "Tab takes all the guess work out of splitting a check with friends. It’s great for servers who would have to provide 4 checks otherwise. The Venmo feature has been wonky for me. I haven’t been able to connect. Otherwise I really love this APP.",
    "rating": 4,
    "date": "2022-11-27T11:54:46-07:00"
  },
  {
    "id": "9311909299",
    "author": "zonkladoo",
    "title": "Great but please optimize for the 14 Pro",
    "content": "Love this app and have been using it for at LEAST 5 years! You save so much time and chaos splitting bills. Please optimize for the iPhone14 Pro, the dynamic island covers the upload screenshot bill option. Thank you!",
    "rating": 4,
    "date": "2022-11-20T19:17:54-07:00"
  },
  {
    "id": "9311262300",
    "author": "evgold42",
    "title": "Bug w iPhone 14 pro dynamic island",
    "content": "Atm, this app hasn’t been coded to work correctly with iPhone 14 Pro: the dynamic island blocks the button for adding existing photos and cannot be activated!",
    "rating": 2,
    "date": "2022-11-20T14:24:53-07:00"
  },
  {
    "id": "9289738740",
    "author": "barronlroth",
    "title": "can’t import on iphone 14",
    "content": "button is hidden",
    "rating": 1,
    "date": "2022-11-14T11:48:05-07:00"
  },
  {
    "id": "9289245361",
    "author": "Davzee77",
    "title": "Davzee",
    "content": "I was told by the Apple store, that this was a music app. NOT TRUE!",
    "rating": 1,
    "date": "2022-11-14T08:22:08-07:00"
  },
  {
    "id": "9283501644",
    "author": "KellyHags",
    "title": "Venmo Integration doesn’t work",
    "content": "Like other reviewers have said, the “Connect Venmo” button brings you to a screen on the Venmo app that said “Allow” or “Deny” and clicking allow does nothing. No sign of a workaround. I can’t justify asking all my friends to download the app without that feature",
    "rating": 1,
    "date": "2022-11-12T16:35:28-07:00"
  },
  {
    "id": "9258538732",
    "author": "IDK[12",
    "title": "The app we all needed",
    "content": "If you eat out with large groups this app is extremely vital. Helped me split a bill 11 ways and got all the points by paying with my credit card. My friends also appreciated the ease of use. Thanks Tab App",
    "rating": 5,
    "date": "2022-11-05T11:11:30-07:00"
  },
  {
    "id": "9224187517",
    "author": "nikki_2014",
    "title": "Game changer",
    "content": "This app has made splitting meals and splitting birthday meals with friends so easy! I use it everytime we go out! It even works if your friends don’t have the app since you can manually add people to the bill, then we just screenshot the split and everybody Venmo’s! Would love to see the direct Venmo from the bill feature come back, any update on when that will be fixed??",
    "rating": 4,
    "date": "2022-10-26T08:44:41-07:00"
  },
  {
    "id": "9220877084",
    "author": "Kenzo.Teves",
    "title": "Doesn’t work for iPhone 14 Pro",
    "content": "It doesn’t let me select existing photos because of the dynamic island",
    "rating": 2,
    "date": "2022-10-25T08:38:26-07:00"
  },
  {
    "id": "9218213686",
    "author": "BJJ_gal",
    "title": "Venmo",
    "content": "Not able to connect to Venmo.",
    "rating": 4,
    "date": "2022-10-24T12:47:16-07:00"
  },
  {
    "id": "9214522126",
    "author": "Jeishdbbswhuwsjb",
    "title": "Great app, needs to be updated for new iPhone 14 pros",
    "content": "Works amazing for splitting the bill, but needs to get its UI updated. I can’t select existing photos with an iPhone 14 pro due to the dynamic island.",
    "rating": 3,
    "date": "2022-10-23T09:36:57-07:00"
  },
  {
    "id": "9213073671",
    "author": "calisvolcomboy",
    "title": "Awesome app",
    "content": "I go out to eat with friends a lot and we all don’t usually have cash, so this is the perfect app for splitting bills.",
    "rating": 5,
    "date": "2022-10-23T00:50:07-07:00"
  },
  {
    "id": "9211237623",
    "author": "daviiinsky",
    "title": "Doesn't allow me to change tax rate",
    "content": "Sometimes splitting the bill I don't need the tax that's already added in the calculator, but it won't let me edit it out. Makes calculating with this extra factor really annoying.",
    "rating": 2,
    "date": "2022-10-22T10:44:43-07:00"
  },
  {
    "id": "9204546792",
    "author": "kzdc",
    "title": "Love it but could use some work!",
    "content": "Been enjoying using this app for splitting bills between groups of people! It’s nice that it also splits the tax and tip and also has a section for any discounts received!\n\nSome things I’ve noticed that could improve my experience:\n- being able to update the name of the bill when creating the bill, not just after it’s been saved would be helpful!\n- Venmo integration hasn’t been working since I’ve downloaded the app :( \n- Would love additional integrations, maybe with Cash App or Apple Cash, etc?\n- When sharing out the text version of the bill, is there a way to include the individual prices for each person’s item and their share?",
    "rating": 3,
    "date": "2022-10-20T11:33:32-07:00"
  },
  {
    "id": "9194466921",
    "author": "DizDragonfly",
    "title": "Not working",
    "content": "Won’t read receipts. Can’t add tax manually. Waste of time.",
    "rating": 1,
    "date": "2022-10-17T09:34:48-07:00"
  },
  {
    "id": "9144690575",
    "author": "JSimani",
    "title": "Great for dinners out with large groups",
    "content": "I absolutely love the utility of this app. Giving four stars because the connection with Venmo doesn’t work, and it would be nice to be able to name a tab while you’re creating it, not just after the fact.",
    "rating": 4,
    "date": "2022-10-02T12:45:48-07:00"
  },
  {
    "id": "9094979218",
    "author": "goodnametakengood",
    "title": "Good idea bad execution",
    "content": "I tried to use the app, but the Venmo link didn’t work. I then sent my friend a direct Venmo for 20% more than the app stated was due, to account for tax and tip, thinking I was being nice, and he called me out for under paying, in front of Dallas, Texas. Tab executives please take this into account and respond ASAP",
    "rating": 3,
    "date": "2022-09-17T13:33:56-07:00"
  },
  {
    "id": "9078892192",
    "author": "App Guy 987",
    "title": "Only way to split checks",
    "content": "I love the fact that this has actually improved my dinning experience by not worrying about a check at the table.",
    "rating": 5,
    "date": "2022-09-12T15:57:01-07:00"
  },
  {
    "id": "9059997963",
    "author": "ghart717",
    "title": "Venmo Integration not Working",
    "content": "The features of this app are great, it’s definitely the best in class, the OCR makes it better than Splitwise by a mile. The only issue is that my Venmo integration doesn’t work. Trying to Connect Venmo brings me to the Venmo app, which asks to Authorize App? but clicking Allow does nothing and clicking Deny brings me back to Tab telling me it was unable to connect. Would be 5 stars if Venmo integration worked.",
    "rating": 4,
    "date": "2022-09-06T21:21:52-07:00"
  },
  {
    "id": "9039407502",
    "author": "Mems1986",
    "title": "Amazing bill splitting app!",
    "content": "Can’t believe how easy it is to use and how useful",
    "rating": 5,
    "date": "2022-08-31T17:35:01-07:00"
  },
  {
    "id": "9021173386",
    "author": "reviewernamedjack",
    "title": "This changed my life",
    "content": "I am a cheap person and my friends are not. This is saving me so much time and money. I wish i found it sooner.",
    "rating": 5,
    "date": "2022-08-26T19:14:43-07:00"
  },
  {
    "id": "9013647187",
    "author": "ratin this...",
    "title": "Great but how to note who paid already?",
    "content": "I love the app as far as organizing who ordered certain things on the bill, but I’m confused as to how to note who has already paid. How do I note that I am the one that put my card down and paid for the whole bill or maybe me and another person split the total in cash for the whole group?",
    "rating": 4,
    "date": "2022-08-24T18:08:30-07:00"
  },
  {
    "id": "8966201531",
    "author": "Bean Delphiki",
    "title": "Best Bill Splitter App",
    "content": "Great features, well thought out, good UI. Wish the Venmo still allowed third party integration.",
    "rating": 5,
    "date": "2022-08-10T18:51:22-07:00"
  },
  {
    "id": "8952424229",
    "author": "Freedmerica",
    "title": "The worst",
    "content": "Horrible interface, hard to figure out tax. Waste of time",
    "rating": 1,
    "date": "2022-08-06T16:53:48-07:00"
  },
  {
    "id": "8931727012",
    "author": "Derek DSD",
    "title": "Amazing!",
    "content": "This is app is like magic, but easier. It works every time and even splits the tip if the gratuity is included. Had been waiting for an app like this for a long time. Thank you!",
    "rating": 5,
    "date": "2022-07-31T14:00:25-07:00"
  },
  {
    "id": "8890619474",
    "author": "lil.piggy",
    "title": "Perfect bill splitting feature that Splitwise is missing",
    "content": "Amazing! You can easily split shared dishes.",
    "rating": 5,
    "date": "2022-07-19T10:40:35-07:00"
  },
  {
    "id": "8884345678",
    "author": "CAD 314",
    "title": "Game changer",
    "content": "Friend showed me it and it made my life soo much easier - that’s what innovation should look like",
    "rating": 5,
    "date": "2022-07-17T14:03:20-07:00"
  },
  {
    "id": "8820727721",
    "author": "Gabe Astard",
    "title": "Will not connect to Venmo",
    "content": "Keeps saying its temp unable to connect to Venmo",
    "rating": 1,
    "date": "2022-06-28T17:54:05-07:00"
  },
  {
    "id": "8813939445",
    "author": "sleepingladycafe",
    "title": "Calculating randomly",
    "content": "The app used to work well but now it adds amount that aren’t there and I can’t find why.",
    "rating": 2,
    "date": "2022-06-26T17:04:11-07:00"
  },
  {
    "id": "8754523374",
    "author": "ashenoy2454",
    "title": "Amazing",
    "content": "So simple and useful",
    "rating": 5,
    "date": "2022-06-08T12:47:44-07:00"
  },
  {
    "id": "8721154392",
    "author": "K-anna-c",
    "title": "Huge Timersaver!!!",
    "content": "I wish this existed years ago. It has saved me so much time and stress of splitting the bill with friends. Works wonderfully!!!",
    "rating": 5,
    "date": "2022-05-29T13:40:26-07:00"
  },
  {
    "id": "8700236635",
    "author": "unhappy-investor",
    "title": "This app rocks, but Venmo integration doesn’t seem to work",
    "content": "I just used this app for the first time, and it is unbelievably awesome. Makes splitting bills super easy. I do, however, feel like half of the convenience would be the Venmo integration, but I was not able to get it to work. When I click “Connect Venmo” all I see is a blank screen with 2 empty circles, and clicking “Allow” does not do anything. After awhile I’ll then get a prompt that says “We were unable to connect your Venmo account, please try again”. \n\nThis app is such a great idea, and I would love to come back and update this review to be 5 stars if the developer could reply & comment with how to get the Venmo integration to work.",
    "rating": 2,
    "date": "2022-05-23T07:08:22-07:00"
  },
  {
    "id": "8674559915",
    "author": "anthony25252525",
    "title": "Enhancement",
    "content": "App is really good, would be nice to have color coding per person and show the total bill color coded, that way you can see what items have been chosen and which have not been chosen yet.",
    "rating": 5,
    "date": "2022-05-15T12:07:21-07:00"
  },
  {
    "id": "8650267873",
    "author": "DeanGFL",
    "title": "Sometimes useful but mostly garbage",
    "content": "The idea is great and functionality is good many times. The problems are many though.\n- You can't enter in more than 5 characters for someone's name. Seems like such a stupid limitation in a modern app\n- The bills OFTEN aren't parsed correctly requiring a lot of manual effort to correct each item, take a really long time to parse or on occasion simply error out\n- There's a really bad bug when you need to edit the name or amount of an item and instead of letting you put the cursor in the middle to fix 1 letter, it'll put the cursor at the end so you have to erase the whole title and retype it\n- You can't export the original receipt image or the final breakdown anywhere\n- The app needs full camera flash when taking pictures EVERY TIME\n- There's no way to breakdown amounts unevenly. For example if me and my buddy got beers but I got 4 and he got 1, we can't specify that in the app",
    "rating": 2,
    "date": "2022-05-08T07:45:25-07:00"
  },
  {
    "id": "8622600248",
    "author": "Nikky1123",
    "title": "Amazing app!",
    "content": "This app is great for bill splitting! Pretty simple and user friendly. I think the only thing I’d add is to have it completely connected to Venmo/Apple Pay/ G Pay/ and even Splitwise!\n\nThe addition of splitting items with venmo / cash app / apple pay / g pay / etc would allow for certain users to send money in any way they’d like and to request items too.\n\nI think if Splitwise & Tab got together it would be an absolute beast of a way to split things and dinners as a sub section!",
    "rating": 4,
    "date": "2022-04-30T09:26:02-07:00"
  },
  {
    "id": "8603160879",
    "author": "New Yorker NYC 123",
    "title": "Calculations are off",
    "content": "Loved the app for a couple of weeks until the app started to add a random “tip included” that I can’t edit. Unfortunately, this makes the app unusable. Please fix! Thank you!",
    "rating": 2,
    "date": "2022-04-24T18:14:32-07:00"
  },
  {
    "id": "8586526858",
    "author": "shoesjob",
    "title": "Can’t edit subtotal",
    "content": "Unable to edit the subtotal which is incorrect so the app is not making splitting a bill easier.",
    "rating": 2,
    "date": "2022-04-19T23:53:10-07:00"
  },
  {
    "id": "8581573636",
    "author": "KDubbou",
    "title": "Easy to Use, Skip the Headaches of Splitting the Bills",
    "content": "It takes into account the individual dishes, cost of those dishes, taxes, tips, and allow you to add names to one or multiple dishes (if you’re sharing). Then after all of that it divides taxes and tips based on your subtotal!!! There’s also an option to split the birthday boy/ girl’s meal, how great is this app! I always use it at group meals, it’s so hard to go without it once you’re use to it. If you need something like this, get it right now!!! I don’t normally write app reviews but this app really deserves a 5 star review!",
    "rating": 5,
    "date": "2022-04-18T12:20:09-07:00"
  },
  {
    "id": "8576080629",
    "author": "evansnap",
    "title": "Almost perfect",
    "content": "Needs Cash App integration",
    "rating": 4,
    "date": "2022-04-16T22:58:53-07:00"
  },
  {
    "id": "8542838247",
    "author": "Pinochle lady",
    "title": "Love the app!",
    "content": "I love the app. It helped me split the check fairly between 11 people. It was easy to use. But I do have a few suggestions. I usually have a meal with a big group(10-20) and everyone wants a separate check. When the restaurant  will not do that I will pay the check and then tell everyone what they owe. Most of the group is technically challenged (seniors) so have no clue how to use an app or do not want to so I get stuck with figuring out the check. It would be helpful if;\n\n1. I could identify the group before I get the check,\n\n2. Be able to see a snapshot of the details for one person  at a time after I identify what they had as part of the totals so I could show them and \n\n3. Allow cents when entering a tip (sometimes when using a credit card we add a tip amount that would round the total)\n\n4. For me the most important one would be to be able somehow to show all the details of the bill when emailing it or texting it or printing it. It only shows the “All Up” $ and a list of the items assigned to each person but not the detail prices, taxes, tip, etc.  for each person.",
    "rating": 4,
    "date": "2022-04-07T14:51:08-07:00"
  },
  {
    "id": "8528852509",
    "author": "Kooolkidzz",
    "title": "Super helpful app",
    "content": "Amazing bc I never have to do math again",
    "rating": 5,
    "date": "2022-04-03T16:54:44-07:00"
  },
  {
    "id": "8524205862",
    "author": "tyoung127",
    "title": "So close",
    "content": "Why is there no way to split items that ordered by different people??!  \n\nFor example. Two people order pancakes. Only one person has to pay for both. Fix this please",
    "rating": 3,
    "date": "2022-04-02T11:17:22-07:00"
  },
  {
    "id": "8495593733",
    "author": "kyoohee",
    "title": "Best free app ever",
    "content": "I would pay money for this app. Makes eating out with friends so easy.",
    "rating": 5,
    "date": "2022-03-25T17:04:01-07:00"
  },
  {
    "id": "8490818852",
    "author": "tetrakis",
    "title": "Intuitive and easy",
    "content": "Really simple way to split the check and not mess with math. The UI is really nice.",
    "rating": 5,
    "date": "2022-03-24T09:16:37-07:00"
  },
  {
    "id": "8481107438",
    "author": "lukcluck",
    "title": "Little clunky but has potential!",
    "content": "Really love how it scans receipts and does what it’s intended to do, which is split receipts! Like that it has the potential to link to Venmo, but unfortunately, it just hasn’t been working so that was a little disappointing. Otherwise excellent tool!",
    "rating": 4,
    "date": "2022-03-21T14:56:30-07:00"
  },
  {
    "id": "8463790725",
    "author": "jason 🦄",
    "title": "Venmo integration broken",
    "content": "Would be great, but I haven’t been able to cknnect to Venmo for months, but the team has pushed updates since. These updates haven’t fixed the issue. I contacted the team and they said they won’t be updating the Venmo integration any time soon\n\nMakes this app useless… Had high hopes, but just an outdated app 😢",
    "rating": 1,
    "date": "2022-03-16T20:43:33-07:00"
  },
  {
    "id": "8448822413",
    "author": "moises333",
    "title": "About time! Love it",
    "content": "It was about time someone came up with this idea. So easy to use so straight forward. The Venmo connection is still not working. Hopefully it will get fixed soon. Thank you!!!",
    "rating": 4,
    "date": "2022-03-12T13:44:49-07:00"
  },
  {
    "id": "8425243253",
    "author": "LightYellowButton",
    "title": "USE THIS",
    "content": "This app is the best ever and makes splitting the bill a TRUE GOSH DANG BREEZE. Feels like magic how can it be so easy!? Why is everyone not using this app!?! Wish I was exaggerating... but, ya’ll, I just love Tab.",
    "rating": 5,
    "date": "2022-03-05T19:47:48-07:00"
  },
  {
    "id": "8424444232",
    "author": "johnboctor",
    "title": "Lifesaver",
    "content": "Amazing app. Super simple to use.",
    "rating": 5,
    "date": "2022-03-05T14:22:58-07:00"
  },
  {
    "id": "8414855682",
    "author": "Ctothedubs",
    "title": "great app!",
    "content": "does exactly what it needs to while being light and free of charge. i would pay money for it if i needed to cause this app is so great!",
    "rating": 5,
    "date": "2022-03-02T22:48:04-07:00"
  },
  {
    "id": "8356251624",
    "author": "Hraai",
    "title": "Venmo not working",
    "content": "The app is not allowing me to connect to Venmo",
    "rating": 1,
    "date": "2022-02-14T14:48:52-07:00"
  },
  {
    "id": "8348375515",
    "author": "BigPapi3697",
    "title": "Amazing app",
    "content": "Amazing app but can not connect to Venmo. Please fix it",
    "rating": 5,
    "date": "2022-02-12T11:11:18-07:00"
  },
  {
    "id": "8328065375",
    "author": "Me, the Reviewer",
    "title": "Great check splitting tool",
    "content": "Awesome app! So easy to get itemize a check! I’d love to see an easier way to split items (like select all the items to be split evenly), though. Otherwise a fantastic way to divvy up the tab.",
    "rating": 5,
    "date": "2022-02-06T22:00:52-07:00"
  },
  {
    "id": "8307143523",
    "author": "_ivoon",
    "title": "Perfect for a night out with friends",
    "content": "The app is great! Saved me a lot of time having to figure out and split what all my friends ordered.\nThere are just some small things I would fix about it such as being able to save friend’s names for multiple bills and maybe a better view of the existing bill (mine saved 4 times not sure why). But overall definitely 5 stars!",
    "rating": 5,
    "date": "2022-02-01T06:04:34-07:00"
  },
  {
    "id": "8282034648",
    "author": "Superbad @ TheAPPera.com",
    "title": "Super helpful app",
    "content": "Truly love using this and dining out has been a breeze!",
    "rating": 5,
    "date": "2022-01-25T10:42:46-07:00"
  },
  {
    "id": "8281837257",
    "author": "kinmeglin",
    "title": "Simple app with unique and useful features",
    "content": "This app is easy to use, especially by taking a photo of the receipt. The ability to split items between people and portion tax and tip based on their subtotal makes this app perfect.",
    "rating": 5,
    "date": "2022-01-25T09:27:28-07:00"
  },
  {
    "id": "8271837688",
    "author": "Luca Demian",
    "title": "Great almost always",
    "content": "Always works for restaurant receipts but it had trouble in one of my Uber eats receipts for some reason, even though it’s worked on delivery apps before. Overall great app!",
    "rating": 4,
    "date": "2022-01-22T19:08:05-07:00"
  },
  {
    "id": "8268401645",
    "author": "Paul Buchman",
    "title": "Amazing!",
    "content": "Very impressed.",
    "rating": 5,
    "date": "2022-01-21T22:30:22-07:00"
  },
  {
    "id": "8244904570",
    "author": "Hit It 'N Quit It",
    "title": "Fantastic! Just needs Venmo connection!",
    "content": "Fantastic app! Where has this been my entire life! Would give it 5 stars if the Venmo feature can get fixed!",
    "rating": 4,
    "date": "2022-01-15T15:38:59-07:00"
  },
  {
    "id": "8227516210",
    "author": "LauraC1221",
    "title": "Best app ever",
    "content": "I don’t know what I would do with this app! Every time I use it my friends think I’m magic! Thank you for existing!",
    "rating": 5,
    "date": "2022-01-10T21:13:05-07:00"
  },
  {
    "id": "8123718570",
    "author": "apche93",
    "title": "Amazing app",
    "content": "Such a crucial time saver and brilliant app. \n\nOnly thing that doesn’t work is the integration with Venmo. There seems to be a bug. But you can just exit the app and type the number manually in Venmo",
    "rating": 5,
    "date": "2021-12-12T14:02:53-07:00"
  },
  {
    "id": "8080975109",
    "author": "thedevinbot",
    "title": "Tricky to use but can make things easier than pen and paper",
    "content": "There are some things that could be better but it works if you can figure it out",
    "rating": 3,
    "date": "2021-11-30T12:48:06-07:00"
  },
  {
    "id": "8074003141",
    "author": "eduito_92",
    "title": "Great App",
    "content": "It’s fantastic and scans the receipt perfectly",
    "rating": 5,
    "date": "2021-11-28T13:02:24-07:00"
  },
  {
    "id": "8045470243",
    "author": "Jlelly215702",
    "title": "An app I depend on",
    "content": "Post lockdown, everyone wanted to catch up and go out. This app has been a life save as we balance out tabs.",
    "rating": 5,
    "date": "2021-11-20T14:33:52-07:00"
  },
  {
    "id": "8042620067",
    "author": "GirlNuke",
    "title": "Won’t connect to Venmo",
    "content": "Won’t connect to Venmo",
    "rating": 1,
    "date": "2021-11-19T20:50:55-07:00"
  },
  {
    "id": "8021099384",
    "author": "arnellim",
    "title": "Works Great",
    "content": "Love this app.  Works great.  \nWould be nice to be able to send breakdown to each person so they can see exactly what they are paying for.  \nAlso, right now I screenshot the All Up breakdown and text it to the group. Would be nice to be able to send that directly without doing a screenshot.",
    "rating": 4,
    "date": "2021-11-13T15:17:36-07:00"
  },
  {
    "id": "8016568160",
    "author": "Kate12317",
    "title": "Great app, but Venmo won’t connect",
    "content": "Overall think this is an awesome app- the scanning works well, the ability to break apart individual items is a great feature, and overall this saves me so much time as the designated paying and bill splitting friend.  BUT I’ve tried multiple times and can’t get the Venmo integration to connect. It opens Venmo and then I when I click allow nothing happens.",
    "rating": 4,
    "date": "2021-11-12T09:27:17-07:00"
  },
  {
    "id": "8012605688",
    "author": "SunLover92",
    "title": "Super useful!!!",
    "content": "I used to use another app that you had to add the items manually, and ever since I discover this once I hadn’t look back. User friendly!!!",
    "rating": 5,
    "date": "2021-11-11T07:01:25-07:00"
  },
  {
    "id": "7989495695",
    "author": "nickazcarate",
    "title": "exactly what i’ve been searching for !!",
    "content": "love the ability to split items into different portions and across different people",
    "rating": 5,
    "date": "2021-11-04T16:53:15-07:00"
  },
  {
    "id": "7974821718",
    "author": "Miss_Aspen",
    "title": "Quick and easy",
    "content": "Works great and you don’t have to invite people to the app! Definite time and friendship saver.",
    "rating": 5,
    "date": "2021-10-31T11:33:36-07:00"
  },
  {
    "id": "7943159436",
    "author": "yiiiii",
    "title": "Lifesaver",
    "content": "I just used it for 13 people at a kbbq restaurant where we split the table into 2 but had everything on one bill PLUS a birthday where we split their cost between everyone. A nightmare of a situation but Tab saved me.",
    "rating": 5,
    "date": "2021-10-22T16:15:11-07:00"
  },
  {
    "id": "7921254057",
    "author": "Nidaime",
    "title": "Timed Out",
    "content": "This app use to work great now I’m having the constant issue where new bill photographs time out and won’t read",
    "rating": 1,
    "date": "2021-10-16T07:52:43-07:00"
  },
  {
    "id": "7893562922",
    "author": "SIMBA25",
    "title": "Nothing like it 5 stars",
    "content": "This application is amazing! I recommend it to everyone I can. They are just always shocked. Some updates are needed to the app though. The layout doesn’t fit on my iPhones screen and buttons are cut off. \n\nAlso having trouble uploading receipts from my library for splitting. Says check my data. But I tried over both wifi and celular and still same issue. No problem when uploading directly from the camera lens. \n\nI’m still gonna give this app a 5 because it’s amazing. Hope you have the time to fix some of these bugs :)",
    "rating": 5,
    "date": "2021-10-08T18:55:50-07:00"
  },
  {
    "id": "7882448229",
    "author": "Mooskie4",
    "title": "Incredible!",
    "content": "One of the best UX/UI experiences I’ve ever had with an app, everyone needs to have this app.",
    "rating": 5,
    "date": "2021-10-05T16:43:59-07:00"
  },
  {
    "id": "7828031722",
    "author": "Moroyce",
    "title": "Long time fan",
    "content": "I discovered the tab app many years ago and haven’t stopped singing it’s praises since. Best way to take care of splitting the bill without too much extra effort. It’s specific, exact and flexible when some people shared and others didn’t. A Godsend!",
    "rating": 5,
    "date": "2021-09-20T18:28:11-07:00"
  },
  {
    "id": "7775635813",
    "author": "squarerootof69",
    "title": "yes lol i",
    "content": "poppa",
    "rating": 5,
    "date": "2021-09-05T17:33:14-07:00"
  },
  {
    "id": "7744853230",
    "author": "Ajb1102",
    "title": "Best app ever",
    "content": "My friends are always impressed by this app’s capabilities. I recommend it to everyone. It just works.",
    "rating": 5,
    "date": "2021-08-28T09:08:21-07:00"
  },
  {
    "id": "7742599848",
    "author": "NicoleInNB",
    "title": "save time, stress & avoid group PTMD (post traumatic math disorder)",
    "content": "Tab is a necessity for your sanity to just enjoy dining in large groups again, because PTMD is real",
    "rating": 5,
    "date": "2021-08-27T19:33:50-07:00"
  },
  {
    "id": "7739022181",
    "author": "Foodie!!!",
    "title": "Excellent app",
    "content": "Super helpful, quick to calculate the bill for a group of people",
    "rating": 5,
    "date": "2021-08-26T20:31:52-07:00"
  },
  {
    "id": "7726020812",
    "author": "Agui1999",
    "title": "Love the idea",
    "content": "Great app concept but there are some bugs that make it difficult to use at times:\n\n1. Sometimes the addition isnt correct - when gratuity is included in the bill it sometimes adds it twice or produces an incorrect total. \n\n2. App doesn’t work without internet connection… not sure why - to me it functions like an advanced calculator.",
    "rating": 3,
    "date": "2021-08-23T09:10:39-07:00"
  },
  {
    "id": "7720754418",
    "author": "Rebeccables",
    "title": "Literally everything I wanted!!",
    "content": "This app is amazing!! It’s literally everything I ever wanted in a bill splitting app!!!! OCR photo scanning, Venmo integration, splitting with your friends… it’s great!! Seriously, if you ever go out to eat with friends and split the bill, get this app!",
    "rating": 5,
    "date": "2021-08-21T23:28:09-07:00"
  },
  {
    "id": "7719670695",
    "author": "Rufusk",
    "title": "Absolute trash",
    "content": "Added 300$ to the bill for an item that didn’t exist.",
    "rating": 1,
    "date": "2021-08-21T15:36:54-07:00"
  },
  {
    "id": "7697334270",
    "author": "Escobear123",
    "title": "My literal favorite app",
    "content": "Greatest, most functional app for eating out or doing activities with friends. Makes it so insanely easy to know who owes how much; no more having to awkwardly request a restaurant split the bill 10 ways.\n\nThe photo scanner makes it super easy, the receipt items & tax are always accurate. Plus, you can save the receipts so can always access them again if needed. Don’t know what I’d do without this",
    "rating": 5,
    "date": "2021-08-15T17:16:31-07:00"
  },
  {
    "id": "7641016225",
    "author": "ProofOfSteak",
    "title": "This app is so simple and effective",
    "content": "Thank you for your prompt response! I would pay for this app :)",
    "rating": 5,
    "date": "2021-07-31T19:14:12-07:00"
  },
  {
    "id": "7628318208",
    "author": "StyleMaven90",
    "title": "Still love this app",
    "content": "I wasn’t using this app too much last year for “reasons” but now that things are reopening I’ve come back to using it. Happy to report it’s still as good as ever!",
    "rating": 5,
    "date": "2021-07-28T10:22:19-07:00"
  },
  {
    "id": "7614669604",
    "author": "Jackfreams",
    "title": "Works some of the time…",
    "content": "Very convenient when it works but it will stop working and not load a receipt at random times. Full connection to WiFi and everything.",
    "rating": 2,
    "date": "2021-07-24T19:04:22-07:00"
  },
  {
    "id": "7592612463",
    "author": "059248",
    "title": "Love this App",
    "content": "Love this app and think it's the best thing to make splitting checks painless and fair. It even let's you split a single line item across multiple people - which I just figured out. I wish they'd consider a more intuitive UX for this - like clicking on the item for it to pop-up with a list of everyone on the bill and selecting all those that it applied to. That said, it ROCKS and getting the ability to send the results of everything over text without anyone having to download the app gets rid of any concerns about if you split the bill correctly. Great job - would love to see this sold as a feature to a payment company like Venmo!",
    "rating": 5,
    "date": "2021-07-18T19:45:03-07:00"
  },
  {
    "id": "7583842477",
    "author": "Gregory Sheppard",
    "title": "Incredible App",
    "content": "It was seamless and intuitive from start to finish. The only issues were with the OCR not reading some items, and the tip being captured as “18” from the line “18%” instead of the actual amount. Easy things to fix on my end (and I know OCR isn’t perfect) and easily still 5 stars.",
    "rating": 5,
    "date": "2021-07-16T10:24:35-07:00"
  },
  {
    "id": "7568395198",
    "author": "mkb1232",
    "title": "Good start",
    "content": "This is a good start because this app is so needed. However I think there are some areas for improvement that are needed before I use it full time. For example, there isn’t (or I haven’t figured out) how to unequally share a multiple quantity item. I.e. if the table bought 6 sodas total, but one friend got 3, you got 2, and another friend got 1, there is no way to split the bill like that. I wish the people were color coded as well, so you could quickly see who was what on the bill.",
    "rating": 3,
    "date": "2021-07-12T08:21:46-07:00"
  },
  {
    "id": "7564051523",
    "author": "Swang530",
    "title": "Uses OCR",
    "content": "The text is recognized about 80% of the time but the manual fixes to the bill is easy. Recommend!!",
    "rating": 5,
    "date": "2021-07-11T04:44:34-07:00"
  },
  {
    "id": "7539841120",
    "author": "Bel_8675309",
    "title": "Looooove this app!",
    "content": "I’ve been using Tab for years and it’s a godsend when going out with groups! Super easy to use and convenient! Really the best bill-splitter out here so far.",
    "rating": 5,
    "date": "2021-07-04T16:32:21-07:00"
  },
  {
    "id": "7539053105",
    "author": "thedavinator12",
    "title": "What a great app",
    "content": "I need more apps like this in my life.",
    "rating": 5,
    "date": "2021-07-04T10:30:49-07:00"
  },
  {
    "id": "7538733570",
    "author": "Jessicaaxleah",
    "title": "Helpful But Needs a Fix!",
    "content": "Ever since my friends have shown me the Tab app, it’s made large group outings at restaurants so much easier. I have used it multiple times now and until last night, have not had any problems. Unfortunately after scanning my receipt, the app did not pick up on the tax amount listed on the receipt, and instead listed it as $0. I understand that sometimes the text may be hard to recognize on receipts, but please add a manual edit option to the tax/tip screen in case any of the amounts need to be modified.\n\nOther than that, overall amazing and helpful app!",
    "rating": 4,
    "date": "2021-07-04T08:40:10-07:00"
  },
  {
    "id": "7538594380",
    "author": "Ilfracicone",
    "title": "An indispensable tool!",
    "content": "This app is a life saver every time I head out with my friends. Fully featured and super convenient, highly recommended!",
    "rating": 5,
    "date": "2021-07-04T07:56:25-07:00"
  },
  {
    "id": "7538337321",
    "author": "knownbetter",
    "title": "Ensures that you don’t pay more than necessary",
    "content": "This is the most useful app ever",
    "rating": 5,
    "date": "2021-07-04T06:38:27-07:00"
  },
  {
    "id": "7506446026",
    "author": "abs413",
    "title": "amazing app",
    "content": "Best app ever! makes life easy for your group and for the server. We would use this for our group of 19 and it was amazing! connect through venmo so everyone pays right then!",
    "rating": 5,
    "date": "2021-06-25T19:31:17-07:00"
  },
  {
    "id": "7419370080",
    "author": "cvrmun",
    "title": "Makes splitting so easy",
    "content": "I love this app. So good. Idk why it has so little reviews it’s so great. You can take a pic or upload one of a receipt, you don’t have to manually input meals. And there are name tags for people who shared meals and there’s even a birthday tag if it’s someone’s birthday and they don’t have to pay. THE BEST - we over complicated everything trying to manually calculate what this app does so easily.",
    "rating": 5,
    "date": "2021-06-02T15:38:11-07:00"
  },
  {
    "id": "7368555072",
    "author": "alorrug",
    "title": "A true life saver!",
    "content": "Makes going out in giant groups simple",
    "rating": 5,
    "date": "2021-05-20T21:26:57-07:00"
  },
  {
    "id": "7310593458",
    "author": "Miniplays",
    "title": "It’s my party trick",
    "content": "Whenever I use Tab in a group setting, I get a million questions. It’s such a great app, and so handy!",
    "rating": 5,
    "date": "2021-05-07T18:29:46-07:00"
  },
  {
    "id": "7306747855",
    "author": "ally_______11245",
    "title": "LIVER SAVER",
    "content": "THIS IS THE BEST APP TO EVER EXIST. All my friends have it and use is regularly, could not exist without Tab!",
    "rating": 5,
    "date": "2021-05-06T18:24:43-07:00"
  },
  {
    "id": "7299133650",
    "author": "jamiexxxx78",
    "title": "Great but could still improve",
    "content": "This app is super great! I think one extra thing that would give it 5 stars would be the ability to send the share code via text to the people on the bill.",
    "rating": 4,
    "date": "2021-05-04T18:16:59-07:00"
  },
  {
    "id": "7264533706",
    "author": "milky blue",
    "title": "Most useful app I found for split!",
    "content": "Take a photo and everyone can tab and pay. Awesome",
    "rating": 5,
    "date": "2021-04-25T18:50:27-07:00"
  },
  {
    "id": "7259890734",
    "author": "megg2593",
    "title": "Wonderful!",
    "content": "Simplified our girls trip weekend so much! Highly recommend for large groups",
    "rating": 5,
    "date": "2021-04-24T13:35:06-07:00"
  },
  {
    "id": "7232633388",
    "author": "BPie1993",
    "title": "Fantastic App",
    "content": "This is an app that when people see its simplicity and power, they all say Wow!",
    "rating": 5,
    "date": "2021-04-17T07:44:38-07:00"
  },
  {
    "id": "7222515286",
    "author": "Nome 234",
    "title": "Essential App",
    "content": "This app has saved me so much time at the end of large group meals. Knowing I have this app, I’ll always take the credit card points in exchange for splitting the bill since it’s so easy. I’ve also saved my friend $30 by noticing an Included Tip on my Tab bill, he had no idea it was there.",
    "rating": 5,
    "date": "2021-04-14T13:29:25-07:00"
  },
  {
    "id": "7206645506",
    "author": "DSchwarz1989",
    "title": "Must half app",
    "content": "This app makes splitting the bill so much easier, it is incredibly well implemented and the OCR works surprisingly well. Haven’t got the Venmo implementation to work properly for myself, but that’s not a big deal. Thanks a lot for maintaining this app, it deserves a lot more users then he currently has.",
    "rating": 5,
    "date": "2021-04-10T08:36:51-07:00"
  },
  {
    "id": "7204208883",
    "author": "eddiedooley",
    "title": "So easy",
    "content": "I have told everyone about this. I worked at a restaurant and told all my customers. Such a great concept and super easy to use",
    "rating": 5,
    "date": "2021-04-09T18:09:53-07:00"
  },
  {
    "id": "7164452864",
    "author": "plaintexty",
    "title": "Very Good",
    "content": "One you learn to use it, it is flawless",
    "rating": 5,
    "date": "2021-03-30T18:33:44-07:00"
  },
  {
    "id": "7095506066",
    "author": "sensory73",
    "title": "What a time to be alive",
    "content": "This makes me what to go to brunch all the time",
    "rating": 5,
    "date": "2021-03-12T12:14:40-07:00"
  },
  {
    "id": "7081607751",
    "author": "mphilly03",
    "title": "Half your family Mormon? DOWNLOAD THIS APP",
    "content": "This app had bugs when I first downloaded it, but it’s actually perfect now. It’s great for large families or friend groups that split the bill, but it’s PERFECT for groups that have a mix of drinkers and non-drinkers.",
    "rating": 5,
    "date": "2021-03-08T18:23:32-07:00"
  },
  {
    "id": "7080820380",
    "author": "Texas Ridge",
    "title": "Great",
    "content": "So easy.",
    "rating": 5,
    "date": "2021-03-08T12:47:54-07:00"
  },
  {
    "id": "7073434806",
    "author": "JoSchmo007",
    "title": "It's nice, but needs some polishing",
    "content": "The image processing is the main attraction. The accuracy of extracting itemized items is decent. Could be better, although I realize that's not an easy task. The app may mistakes items with the word 'tips' in it (e.g. S-tips/steak tips) as included tips and so it will not appear in the list of items. Deleting the included tips should automatically add this misinterpreted item to the list, but it doesn't. It has to be entered manually. \nI'd like to see the tax displayed as a percentage as well. Because I know the tax in my area is 7%, I'd quickly know if the list of items is wrong. I also would like to see a pre/post tax option to for tip calculations.",
    "rating": 3,
    "date": "2021-03-06T14:08:57-07:00"
  },
  {
    "id": "7022314948",
    "author": "Christine11402",
    "title": "Good but not",
    "content": "Really wish there was functionality to spilt the cost of items in this app. Like when my friends all share apps. I’m going to delete this app until this functionality is included.",
    "rating": 3,
    "date": "2021-02-21T10:20:29-07:00"
  },
  {
    "id": "6882741276",
    "author": "Tdghu",
    "title": "Works great, no complaints",
    "content": "See above",
    "rating": 5,
    "date": "2021-01-17T17:53:02-07:00"
  },
  {
    "id": "6824194658",
    "author": "TheDeathly",
    "title": "Almost perfect!",
    "content": "I'm really hoping the developers read this! Just installed it today and used it for grocery shopping, not the most intended thing but it worked out well! Then I ran it through say ordering take out from delivery or uber eats and that's where it falls short just barely. It would be fantastic to have a flat fee option near the end that gets split equally among everyone for things like service fees or delivery fees. This fee shouldn't be taxed or influence it. I think once that gets added the app will be perfect to use In restaurants and for delivery services with friends. Seems like a perfect fit for this cpvid influenced world.",
    "rating": 4,
    "date": "2021-01-02T17:51:58-07:00"
  },
  {
    "id": "6732121168",
    "author": "Dasm14",
    "title": "Really helpful",
    "content": "I save so much time with this app. Was skeptical at first, but turns out to be a massive time saver and wayyy better than excel lol",
    "rating": 5,
    "date": "2020-12-08T15:21:44-07:00"
  },
  {
    "id": "6724201169",
    "author": "neixnsk",
    "title": "Great app",
    "content": "Awesome",
    "rating": 5,
    "date": "2020-12-06T08:45:05-07:00"
  },
  {
    "id": "6681022072",
    "author": "Djnoz809",
    "title": "Great tool",
    "content": "I been using the app for years. Works great in the USA. But bow I started traveling to other parts of the world, the app doesn’t recognize other languages and I have to enter bills manually. If at least the app recognizes the amount but it doesn’t.",
    "rating": 4,
    "date": "2020-11-24T07:38:53-07:00"
  },
  {
    "id": "6649033742",
    "author": "devildrifterx",
    "title": "Wonderful app, I’d even pay for it if I had to!",
    "content": "Honestly this app is amazing! After getting shortchanged constantly from cheap “friends” this gets rid of that and everyone pays their fair share! I’d honestly pay for this app because it’s one of which I think would be worth something!",
    "rating": 5,
    "date": "2020-11-15T10:09:29-07:00"
  },
  {
    "id": "6591753588",
    "author": "Zach857953898",
    "title": "One thing",
    "content": "Love the app, but you need to be able to pick how many of one item you had instead of splitting all of them equally",
    "rating": 4,
    "date": "2020-10-30T16:33:24-07:00"
  },
  {
    "id": "6561708800",
    "author": "Okimcooler",
    "title": "Great but needs help",
    "content": "This app is great however I ran into the issue where if you’re splitting and someone got more then one of the same items (for example: your friend got 3 out of the 5 margaritas on the bill and receipt is itemized margarita x5) there’s no way to edit to split where one friend got 3 of those 5 drinks. It instead splits it evenly.",
    "rating": 3,
    "date": "2020-10-22T04:48:44-07:00"
  },
  {
    "id": "6538899877",
    "author": "IlanWallentin'sOldRoommate",
    "title": "Great app, but week limit to edit is annoying",
    "content": "Great UI and easy to use, but why can’t we edit a bill past a week? I use this app for things like grocery/shopping runs to split with my roommate, and having the ability to edit old expenses would be huge.",
    "rating": 4,
    "date": "2020-10-15T13:42:08-07:00"
  },
  {
    "id": "6530115548",
    "author": "Johnson4o",
    "title": "Meh, ocr for item names is completely unnecessary",
    "content": "The app kind of works, but the OCR is a bit of a try hard feature that makes the app unusable in foreign countries.\n\nI have a suggestion, the algorithms at play here are clearly awesome and can successfully divide the bill into items, how about just giving us the option to view those items as slices of the photo instead of OCR? I'd instantly give this 5 stars if I could have that toggle! \n\nAlso I couldn't figure out how to change the currency, but that's probably just me so...\n\nRe developer response:\nThanks for taking an interest in my suggestion! It’s all here, I already wrote what I think can be improved. Let me turn off OCR and just look at slices of the photo, and make the change currency option (if it exists) findable.",
    "rating": 2,
    "date": "2020-10-13T02:05:02-07:00"
  },
  {
    "id": "6472590619",
    "author": "EJ_Rios",
    "title": "Yay",
    "content": "Yay was easy",
    "rating": 5,
    "date": "2020-09-26T19:20:47-07:00"
  },
  {
    "id": "6441589633",
    "author": "spryor918",
    "title": "Super convenient and user friendly",
    "content": "This app is so easy to use! It directly links with Venmo and is super fast. Makes going out to dinner hassle-free.",
    "rating": 5,
    "date": "2020-09-18T05:32:47-07:00"
  },
  {
    "id": "6410087951",
    "author": "jcorral3",
    "title": "Literally the best app ever made",
    "content": "Get it.",
    "rating": 5,
    "date": "2020-09-08T21:41:37-07:00"
  },
  {
    "id": "6408993571",
    "author": "israel.perez",
    "title": "Best Bill-Splitting App, BUT...",
    "content": "I love how you’re able to assign each item to people and mark if it was shared. However, why do names need to be shortened? But my actual gripe is how you aren’t able to enter the percent tax instead of just entering the total tax on the bill so that it accurately distributes the percent tax you should pay . If I order $10 worth of food and someone else orders $50 worth of food, is it actually fair to divide the tax in half? Please fix this!!!",
    "rating": 4,
    "date": "2020-09-08T13:22:10-07:00"
  },
  {
    "id": "6399091675",
    "author": "PhuGazie",
    "title": "Good start but looking for improvements",
    "content": "Could benefit from user testing.  Editing bill isn’t intuitive or easy... can’t update name of bill to organize, and Venmo integration doesn’t work.  Would be great to have quick names, either from contacts or previous inputs to make it a little faster.",
    "rating": 3,
    "date": "2020-09-05T14:40:11-07:00"
  },
  {
    "id": "6384147783",
    "author": "pnyc12",
    "title": "Incredible app to split bills at restaurants",
    "content": "The functionality and user experience in this app is unparalleled. I’ve been looking for a good bill splitting app for a long time and this one is perfect. Snap a quick pic of the bill, it recognizes each line item and lets you assign a recipient to each plate. It then let’s you go even further and not only identify items that were shared - but also items that were shared unevenly. Meaning you can charge different percentages of the shared plate to different people. It takes all the complication out of splitting the bill and allows easy sharing the split bill calculations/breakdowns with friends. I will be using this app constantly. GAME CHANGER!",
    "rating": 5,
    "date": "2020-09-01T07:33:55-07:00"
  },
  {
    "id": "6343580172",
    "author": "ousepe",
    "title": "Love it a lot, except a few things",
    "content": "Add ability to store names, so one doesn’t have to type it every time. People typically go out with the same gang. Different colors by name rather than all being orange. Ability to type the bill/ restaurant name at the start, so it saves it by that name, rather than having to edit it.",
    "rating": 4,
    "date": "2020-08-20T21:27:36-07:00"
  },
  {
    "id": "6326794069",
    "author": "Amyyh0",
    "title": "Highly recommended; used often",
    "content": "I recommend this app to my friends whenever I go out to eat! It is super easy to use — you just take a photo of the bill and then the app magically itemizes the bill.\n\nYou can then correct anything per line and rename items.\n\nAfter you do so, you can then add each person, and then select which item they had. It’s also super useful if splitting one dish between multiple people.\n\nThe app then calculates all the tip, tax, and then the totals PER person (also itemizes in detail). If your friends have the app and are linked to Venmo, you can request in-app.\n\nIt’s a game changer and I use it all the time when eating out. I’m sometimes able to request (and receive) payment from all my friends even before the waiter picks up the check!\n\nAgain, highly recommended.",
    "rating": 5,
    "date": "2020-08-16T09:56:30-07:00"
  },
  {
    "id": "6303135428",
    "author": "ebeck1352",
    "title": "Doesn’t read grocery receipts well",
    "content": "I found that this didn’t work the way I had hoped with splitting grocery receipts. Basically it doesn’t read the receipt properly because so many items have a quantity, price for each unit/lb/etc and then the total price of the item. I’m only interested in the total for splitting purposes. I had really hoped this would help with the tedious task of splitting grocery bills with my boyfriend but so far hasn’t helped to save time",
    "rating": 2,
    "date": "2020-08-10T10:07:43-07:00"
  },
  {
    "id": "6300071644",
    "author": "hahahahahanna",
    "title": "Really easy to use",
    "content": "Really easy and quick to use",
    "rating": 5,
    "date": "2020-08-09T14:44:52-07:00"
  },
  {
    "id": "6296209976",
    "author": "hfkshbfohs",
    "title": "Most useful thing ever",
    "content": "Going out with penny-pincher friends has never been easier.",
    "rating": 5,
    "date": "2020-08-08T14:24:24-07:00"
  },
  {
    "id": "6122276496",
    "author": "Blood. Shoot",
    "title": "Game changer",
    "content": "I love this app it’s revolutionary and helps so much to split a bill no fuss",
    "rating": 5,
    "date": "2020-06-25T19:01:06-07:00"
  },
  {
    "id": "6101737107",
    "author": "Weedle12",
    "title": "Time + Stress Relief",
    "content": "Was recommended this app down the beach during a two week trip with varying groups of 6-11 people. Usually venmo-ing post meal is a nightmare trying to do math based on what everyone got. \n\nNot anymore.\n\nTake a picture of the bill, line up what each person got on the bill, send out venmo requests (or cash requests), done. \n\nWill be recommending and using this app during my next trip!",
    "rating": 5,
    "date": "2020-06-20T13:40:38-07:00"
  },
  {
    "id": "5848421500",
    "author": "HelloWorld1492",
    "title": "Many years of loving this app",
    "content": "This app is so useful. A friend excitedly showed it to me 2 or so years ago and it’s performed great ever since I downloaded it then. It is so handy and not obtrusive at all to use, thanks to the camera. Perfectly designed. \n\nOnly thing I would possibly change is letting the nicknames be longer, which is so minor. Thanks for designing this handy app!",
    "rating": 5,
    "date": "2020-04-22T07:28:46-07:00"
  },
  {
    "id": "5673791812",
    "author": "Avp123456",
    "title": "Time/money saver!",
    "content": "Love this app - makes my life sooooo much easier and they’ve made great improvements since when I very first discovered it. Works really well!",
    "rating": 5,
    "date": "2020-03-17T11:01:28-07:00"
  },
  {
    "id": "5634643929",
    "author": "sn o w",
    "title": "Essential app for eating out",
    "content": "This app aims, and I believe succeeds, in solving the most awkward and difficult part of eating out - splitting the bill. \n\nOver the past few weeks I have used it with a range of receipts, and on average it does a great job of identifying foods. Even if it misses something, making manual edits is very simple.\n\nI was actually going to recommend that there be a feature for exporting a bill to text so it can be sent to a group chat, but I realized the app already has that so you can tell the developers have thought of everything, lol. \n\nEdited my originally negative review after using app a bit more.",
    "rating": 5,
    "date": "2020-03-08T16:44:52-07:00"
  },
  {
    "id": "5632882742",
    "author": "Narrasingg",
    "title": "So mole to use and works like a charm",
    "content": "Love this app, Easy to add people and work perfectly.",
    "rating": 5,
    "date": "2020-03-08T06:49:37-07:00"
  },
  {
    "id": "5609022647",
    "author": "Aiminator51",
    "title": "You will not regret this",
    "content": "Download this. You will love it. It takes the headache out of splitting your bill. And if you’re cheap, no more overpaying for what you didn’t eat.",
    "rating": 5,
    "date": "2020-03-02T20:50:59-07:00"
  },
  {
    "id": "5609019489",
    "author": "L Alexandra",
    "title": "Best ever",
    "content": "This is my favorite app of all time...not kidding",
    "rating": 5,
    "date": "2020-03-02T20:49:55-07:00"
  },
  {
    "id": "5513683310",
    "author": "Ribwings",
    "title": "Can only do one bill",
    "content": "It was a great app the one time I got to use it. Now every time I try to make a new bill, it’ll just have the total from the first bill I ever scanned on the app. So each new receipt I attempt to scan and split up, when I go to tax/tip it says a completely different subtotal.",
    "rating": 1,
    "date": "2020-02-10T10:07:23-07:00"
  },
  {
    "id": "5509617275",
    "author": "jordanalyssaf",
    "title": "so awesome",
    "content": "I love this app",
    "rating": 5,
    "date": "2020-02-09T12:01:23-07:00"
  },
  {
    "id": "5506682893",
    "author": "semathison",
    "title": "Perfect for splitting a tab!",
    "content": "Splitting a tab has never been easier. Download this app.",
    "rating": 5,
    "date": "2020-02-08T21:07:00-07:00"
  },
  {
    "id": "5502124739",
    "author": "Bvz67",
    "title": "Said I owed $400 when it was really more like $75",
    "content": "Fix your bugs",
    "rating": 1,
    "date": "2020-02-07T21:07:41-07:00"
  },
  {
    "id": "5493441636",
    "author": "Corinzia",
    "title": "Very useful",
    "content": "Makes it easy to split big parties bills so that each person can pay what they got.",
    "rating": 5,
    "date": "2020-02-05T19:39:05-07:00"
  },
  {
    "id": "5474739427",
    "author": "Shsjsjisicmekw183649",
    "title": "Super convenient",
    "content": "Everything is well thought out. One of the best apps on the market",
    "rating": 5,
    "date": "2020-02-01T06:35:37-07:00"
  },
  {
    "id": "5441297358",
    "author": "Kinnaird213",
    "title": "Great product",
    "content": "First time user! Love the app already, made life so much easier for me and my family when dining together. Only have two suggestions/questions:\n1. I tried signing up a couple of times and each email that I got with the link would not take me anywhere once I clicked on it. Just sent me to my google chrome but nothing would happen.\n2. I would suggest a feature to put the tip percentage including the tax as a percentage of the tip. My family and friends usually always tip of the total (subtotal plus tax) rather than just the subtotal. \n\nThank you and I love the app so far!",
    "rating": 5,
    "date": "2020-01-23T20:49:52-07:00"
  },
  {
    "id": "5409111889",
    "author": "Lulu60606",
    "title": "Great app",
    "content": "I love how easy this app makes splitting group dinners! However, I wish the tip was calculated post-tax - I think it’s standard to tip after tax. I just shorted a waiter because I used Tab’s calculation without realizing :/ please make this an option!",
    "rating": 5,
    "date": "2020-01-15T20:04:35-07:00"
  },
  {
    "id": "5408508624",
    "author": "GSE001",
    "title": "App is great",
    "content": "Updated:\n\nForgot to check the FAQ, so updated my review after a response from the developer. Super useful, and I will continue to share with everyone I dine with. \n\nPrevious review: \n\nThis app is great, one change that needs to happen is if I order multiple of one item, I should be able to add myself multiple times to an item so it properly splits the costs. For example, on a recent tab, I ordered 3 drinks when everyone else ordered 1. We couldn’t properly split the tab in the app because I had a disproportionate amount of drinks compared to everyone else. Otherwise love the app and has great potential.\n\nAlso side note, there should be a function in the app to share it with people so they don’t need to look it up in the App Store.",
    "rating": 5,
    "date": "2020-01-15T16:24:09-07:00"
  },
  {
    "id": "5405496657",
    "author": "ateebeb",
    "title": "Useful",
    "content": "Very helpful when a restaurant doesn’t split bills for their customers!",
    "rating": 5,
    "date": "2020-01-14T23:23:20-07:00"
  },
  {
    "id": "5403827500",
    "author": "AndoirdIphone user",
    "title": "Great app",
    "content": "Great app, but I have noticed that you no longer have the ability to export all the details to a text message. This was great to forward to people who you weren’t necessarily friends with but wanted To give them notice on what they needed to pay.",
    "rating": 5,
    "date": "2020-01-14T12:59:11-07:00"
  },
  {
    "id": "5390790512",
    "author": "rebs21012",
    "title": "This app is amazing",
    "content": "There are a few weird functionality things that I wish would be fixed or modified (happy to provide feedback if the developers reach out) but all in all this app has saved our friends group so much time and energy splitting the bill. We have a few people that don’t drink, or only eat special or specific food and so when we go out a few people always owe a lot more than others. This app is so easy to use, we use it all the time now.\n\n1. I didn’t understand how the birthday button worked, but now that I do I love it! Allocate everything and then hit the button and say whose bday it is and it splits it amongst everything.\n\n2. We had a weird tax on the bill last night and it took us a while to figure out how to edit it. There were 2 “sub” taxes listed and a total and the app added all 3 in.\n\n3. It’s hard to label the bill. You have to go back in and hit it from a weird screen. \n\n4. I love that I can text the breakdown of the costs to my friends, but like the layout and info of the breakdown in the app. Might be nice if you could text the image of the breakdown by person, instead of the whole thing, or for it to make a pdf of the breakdown that I could text to everyone! \n\nAll in all the app is great and with weird situations the app usually has a response, it’s just hard to figure it out when that happens. We all love it. Most useful app I own by far!!!!",
    "rating": 5,
    "date": "2020-01-11T10:22:54-07:00"
  },
  {
    "id": "5388037206",
    "author": "roadblock7",
    "title": "A gem",
    "content": "Tab is a lifesaver and I don’t know how this was not invented earlier. I recommend this app to everyone",
    "rating": 5,
    "date": "2020-01-10T21:00:25-07:00"
  },
  {
    "id": "5387165129",
    "author": "Quijote79",
    "title": "Great app",
    "content": "Love it. When coworkers go out to lunch and split the tab this works perfectly an no one complains!",
    "rating": 5,
    "date": "2020-01-10T15:56:27-07:00"
  },
  {
    "id": "5382956615",
    "author": "Jonrobinson94",
    "title": "Everything is great, but 1 thing",
    "content": "Clean design and easy to use. \n\n1 Flaw is that you should be able to customize the additional tip section. \n\nI was with a large group and the app did not account for the extra tax on gratuity so I had to add it as an additional food item. This skewed everyone’s final totally due to the unclaimed item on the receipt.",
    "rating": 4,
    "date": "2020-01-09T17:44:30-07:00"
  },
  {
    "id": "5365318138",
    "author": "Kate161616161",
    "title": "Literally genius",
    "content": "Been needing this my whole life. Group dinner life saver.",
    "rating": 5,
    "date": "2020-01-05T11:14:14-07:00"
  },
  {
    "id": "5315240014",
    "author": "DezApples",
    "title": "Great app",
    "content": "Remarkably can scan almost anything.  Just wish I could adjust discount and tip manually at the end.  Sometimes it misreads negative numbers and I often tip round numbers.",
    "rating": 4,
    "date": "2019-12-24T15:39:25-07:00"
  },
  {
    "id": "5306328113",
    "author": "kait726",
    "title": "Must have app!",
    "content": "One of the best apps I have downloaded. Extremely user friendly and makes splitting tabs so easy. Includes tax and tip so you don't have to think about it!",
    "rating": 5,
    "date": "2019-12-22T14:52:03-07:00"
  },
  {
    "id": "5283978273",
    "author": "Alxvry",
    "title": "Unknown Unclaimed Amount",
    "content": "There’s bug where an unknown unclaimed amount is added to a new bill.\n\nUpdate: we’ll duh on me! Now knowing some line items captured by OCR shouldn’t be included in the “menu”. Makes sense now. It took a few attempts to finally figure out how to tag line items to people properly.  The only thing left to mention is if you include the tax in your splits, the the next page should be $0 for taxes.  If you remove the tax line item and add the tax in the next page, then your tip amount is before taxes and you’ll have to manually split the taxes.  Confused you yet?  In the end, I’ve figured it out.  Great app for large groups!",
    "rating": 3,
    "date": "2019-12-17T08:55:01-07:00"
  },
  {
    "id": "5281731112",
    "author": "SantiLove9",
    "title": "Life changing",
    "content": "Not to be dramatic but this app absolutely changed my life! Group dinners & brunches are no longer stressful and awkward! I tell everyone I know about how incredible this app is. The recent update that lets you see everyone’s totals & breakdowns together at the end is great. Love that you can do on the spot or upload a photo and sort out later. It’s transformative - get this app and make group outings a breeze!! \nOh: The only weird thing is that names can only have 4 letters (why?!) nothing major just odd.",
    "rating": 5,
    "date": "2019-12-16T19:04:57-07:00"
  },
  {
    "id": "5212764159",
    "author": "Mrbruin1",
    "title": "No splitting checks? No problem!",
    "content": "Great app, very user-friendly and intuitive. This app has saved tons of time and is convenient when everybody’s in a rush. Recommend!",
    "rating": 5,
    "date": "2019-11-29T09:33:26-07:00"
  },
  {
    "id": "5205929394",
    "author": "kkfox911",
    "title": "My favorite new app",
    "content": "I love this app. It makes it so easy during group dinners. I would love it if it could just connect to venmo without every user having to have the app if at all possible. But other than that it’s easy and so functional.",
    "rating": 5,
    "date": "2019-11-27T19:02:03-07:00"
  },
  {
    "id": "5134982938",
    "author": "kt898989",
    "title": "Best app ever",
    "content": "Literally an amazing app. So helpful.",
    "rating": 5,
    "date": "2019-11-13T20:42:00-07:00"
  },
  {
    "id": "5124450202",
    "author": "sofpnyc",
    "title": "This app is a must.",
    "content": "So fast, so easy to use, and so efficient. If you are ever splitting the check you need this app.",
    "rating": 5,
    "date": "2019-11-11T11:39:48-07:00"
  },
  {
    "id": "5095549365",
    "author": "forrestgj",
    "title": "Life changing",
    "content": "This app is incredible, so easy to use and such a great idea. I literally hated going to big dinners because of the hassle at the end with big checks and tab solves all of those issues. A must have for anyone who eats out. Heard about it by word of mouth and I’m going to tell everyone I know about this app, so simple and solved so many issues. Love love love",
    "rating": 5,
    "date": "2019-11-06T14:22:55-07:00"
  },
  {
    "id": "4998739448",
    "author": "BlueDevil911",
    "title": "Best App Ever for groups",
    "content": "My friends and I go out frequently and this app has made splitting the bill so easy. One person pays then we all cash or Venmo them right in app. It’s AWESOME!",
    "rating": 5,
    "date": "2019-10-22T14:10:45-07:00"
  },
  {
    "id": "4955684736",
    "author": "aldeharv",
    "title": "Wish I Had This Earlier",
    "content": "This app is amazing. It doesn’t just split it but itemizes each item on your bill, so each person can get an exact total with tip and tax included. A+",
    "rating": 5,
    "date": "2019-10-16T07:12:05-07:00"
  },
  {
    "id": "4940916038",
    "author": "Kimberly&Bucky",
    "title": "Works great but can’t creat account",
    "content": "I have requested to set up an account a few times now, but the link emailed to me only results in a browser search for this app. No next steps, no verification. Without an account you can’t save your bills/receipts. I did enjoy how easy it was to split a shopping receipt with my roommate.",
    "rating": 4,
    "date": "2019-10-13T09:34:18-07:00"
  },
  {
    "id": "4893217881",
    "author": "Hugo_Molina",
    "title": "Nice app but needs some UI adjustments",
    "content": "When adding names they show up on the bottom which works if you have an iPhone with a home button. But for newer iPhones with FaceID and no home button apps tend to avoid having actionable buttons in lower area where the white bar the represents home is at. In this app when you have multiple names on bottom and have to swipe left/right it sometimes causes swiping between apps because that area within iOS is design that way. A solution would be to move the names a little higher and make them a little bigger too. This is frustrating and I sometimes end up just not using the app at all when it occurs.",
    "rating": 3,
    "date": "2019-10-05T11:30:00-07:00"
  },
  {
    "id": "4849121423",
    "author": "Ludachic",
    "title": "Venmo Connection Never Works!!!",
    "content": "I’m always listed as disconnected on Venmo :(",
    "rating": 1,
    "date": "2019-09-27T18:29:38-07:00"
  },
  {
    "id": "4842086213",
    "author": "BB1264",
    "title": "More payment options, please!",
    "content": "Love the app but would really love some payment options other than Venmo. I have friends who prefer to use the Cash App and more stubborn family members who only use PayPal. Additional payment options would make this app 5 stars!",
    "rating": 4,
    "date": "2019-09-26T13:48:25-07:00"
  },
  {
    "id": "4834868630",
    "author": "jennbrauer",
    "title": "BEST APP EVER",
    "content": "The fact that it’s 2019 and people still splitting bills with a calculator or my hand is crazy to me. Hands down the best and most convenient app ever.",
    "rating": 5,
    "date": "2019-09-24T23:49:55-07:00"
  },
  {
    "id": "4826069136",
    "author": "jytvi678rtov76r6o7",
    "title": "Super duper useful!",
    "content": "Can’t believe it’s taken this long for an app like this to exist. So easy to use and incredibly helpful!",
    "rating": 5,
    "date": "2019-09-22T18:59:21-07:00"
  },
  {
    "id": "4730750676",
    "author": "laineyyy52",
    "title": "Great app, wish Venmo integration was better",
    "content": "Works perfectly but wish you could use Venmo to request the amount straight from your phone. There’s already integration but you can’t request money, only send.",
    "rating": 4,
    "date": "2019-09-05T07:27:44-07:00"
  },
  {
    "id": "4691076885",
    "author": "Jasonw221",
    "title": "Changes eating out forever",
    "content": "Makes it way easier to split a bill between people, whether they have venmo or just cash. I wish it had support for the cash app, but it works great with venmo",
    "rating": 5,
    "date": "2019-08-29T09:56:13-07:00"
  },
  {
    "id": "4678067158",
    "author": "Lnzr",
    "title": "This is the best app to have when going out with groups of friends",
    "content": "Seriously, where has this been my whole life. I’ve used this app for the last 8 months or so and it’s been a life saver. So much quicker than trying to manually add up everyone’s bill with tax and tip, and even figuring out how to split shared items! Love the ability to adjust the tip % and also birthday feature that lets you treat someone by splitting it up equally! Everyone I have recommended it to also loves it!!",
    "rating": 5,
    "date": "2019-08-26T10:00:07-07:00"
  },
  {
    "id": "4662924947",
    "author": "sarah13421",
    "title": "Best app!",
    "content": "Everyone should use this. It’s amazing",
    "rating": 5,
    "date": "2019-08-23T19:19:46-07:00"
  },
  {
    "id": "4533478073",
    "author": "JoeHanko",
    "title": "So Quick and Easy!",
    "content": "Having the ability to just scan the bill is amazing and it’s much quicker than doing it the old-fashioned way. Plus you can connect your Venmo which is a great feature. And your waiter will thank you!",
    "rating": 5,
    "date": "2019-07-28T13:45:15-07:00"
  },
  {
    "id": "4504276873",
    "author": "3dz2",
    "title": "Best Bill Splitting App of All Time",
    "content": "This is quite possibly the most useful utility on the App Store. Everyone needs this app, yesterday.",
    "rating": 5,
    "date": "2019-07-22T20:23:52-07:00"
  },
  {
    "id": "4490347266",
    "author": "RoyceAlmighty",
    "title": "Great app",
    "content": "Works great!",
    "rating": 5,
    "date": "2019-07-20T01:39:23-07:00"
  },
  {
    "id": "4487109569",
    "author": "Clumsylikebambi",
    "title": "This is the best app I have installed on my phone",
    "content": "This solves every pain point associated with going to dinner with a group of folks. Servers will love you because you don’t have to hand over seven cards with amounts to charge on the back. Your dining companions will love you because nobody has to pull out a pen and calculate what everyone owes (and then end up guessing on tax+tip), AND it solves the “I just had salad and she had two cocktails I don’t want to split this evenly” problem. I cannot speak highly enough off this app: it’s intuitive, beautiful, and unobtrusive. It’s PHENOMENAL.",
    "rating": 5,
    "date": "2019-07-19T12:34:53-07:00"
  },
  {
    "id": "4484042724",
    "author": "Chris Cuev",
    "title": "Totally bugged",
    "content": "I split up the bill, then go to the total screen and the subtotal is like 4 times what it is supposed to be.",
    "rating": 1,
    "date": "2019-07-19T00:50:51-07:00"
  },
  {
    "id": "4454467227",
    "author": "boopbop27",
    "title": "The best app!!!!!!",
    "content": "I’ve told everyone I know to download Tab. Makes it remarkably easy to split bills, takes the headache out of dining out with friends, and the connection with Venmo is so helpful! 100/10!",
    "rating": 5,
    "date": "2019-07-13T08:51:48-07:00"
  },
  {
    "id": "4440923636",
    "author": "BC Sis :)",
    "title": "Love!",
    "content": "I really love this app and think everyone should download it! It’s definitely user friendly and really simplifies group meals (which I’ve often avoided in the past because of splitting the bill lol). I do have one qualm tho! I was the one to put down my card and noticed that the total bill amount did not equal the bill amount on the actual receipt. Later when I got home, I realized that Tab based the tip on the subtotal BEFORE tax whereas the restaurant based the tip on the subtotal WITH tax (which is a much higher amount). If there’s a way to change that so the user has the option to change which total is taxed, that would be great! :)",
    "rating": 5,
    "date": "2019-07-10T19:35:18-07:00"
  },
  {
    "id": "4383241799",
    "author": "fancyflutist2211",
    "title": "Great for eating out with friends",
    "content": "Saved many a headache. I recommend to everyone that I dine with and as soon as they see me use it, they usually download. Intuitive and quick and can be used for large groups, at least 16.",
    "rating": 5,
    "date": "2019-06-28T16:26:37-07:00"
  },
  {
    "id": "4378734640",
    "author": "Russt17",
    "title": "Yesssss thank you Tab",
    "content": "This app solves a problem that has been a pain since humans began exchanging goods and services. Thanks Tab!\n\nObviously the UI needs some improvement but overall it gets the job done. When you divide a single item into parts it should let you undo that, though. I had to retake the picture instead.",
    "rating": 5,
    "date": "2019-06-27T16:02:53-07:00"
  },
  {
    "id": "4284906288",
    "author": "hotshotgolfer07",
    "title": "Best app on my phone",
    "content": "Honestly the most useful app on my phone. I eat out all the time with friends and restaurants are not so friendly splitting bills in Chicago. This along with Venmo makes it super easy to pay with one card and collect cash from others. Will always use Tab as long as it’s available!",
    "rating": 5,
    "date": "2019-06-08T11:28:30-07:00"
  },
  {
    "id": "4281590399",
    "author": "Sheezy310",
    "title": "Fantastic",
    "content": "Unbelievable how well made the app is. I hate having people always try to split the bill on 5 different cards for different amounts so I just give my card, everyone sends me money and I get all the points. I can't think of a single thing that could be improved. Do yourself a favor and try it you can thank me later.",
    "rating": 5,
    "date": "2019-06-07T22:14:10-07:00"
  },
  {
    "id": "4232790114",
    "author": "CookingInCollege",
    "title": "Brilliant",
    "content": "This makes life so much simpler! I am good at math and so I always end up tracking down how much everyone owes but now it’s just so much easier! The bigger the group the happier you will be to have Tab at hand. Just try to get the bill as soon as possible to avoid having people starting to leave before you’ve gotten settled!",
    "rating": 5,
    "date": "2019-05-29T19:33:33-07:00"
  },
  {
    "id": "4228538107",
    "author": "Shawnsingh786",
    "title": "Make tip screen optional",
    "content": "I feel like this app is really good, but there should be some way to skip the tip screen if we are trying to split something that does not need a tip (I.e. groceries). I understand you can change the tip percent to zero but there should be a button that does it quickly.",
    "rating": 4,
    "date": "2019-05-28T23:02:36-07:00"
  },
  {
    "id": "4227185424",
    "author": "Lindsayms14",
    "title": "Somehow my tip was $1000",
    "content": "I’m not sure what to say. So many things went wrong. We got 11 of the same drink - it came out as one so no way to split it. We decided to at least figure out the food and my tip came out to over $1000 which is $800 more than the total bill. Not happy at all. Not sir who’s this successfully worked for others so sad this didn’t work out.",
    "rating": 1,
    "date": "2019-05-28T16:07:26-07:00"
  },
  {
    "id": "4214307180",
    "author": "Crooks2002",
    "title": "Awesome!",
    "content": "Had this sitting on my phone for ages, realized I had it while out to breakfast with 3 other friends and in a few moments had everything split easily! Highly recommended~",
    "rating": 5,
    "date": "2019-05-26T10:17:55-07:00"
  },
  {
    "id": "4188654040",
    "author": "jessica render",
    "title": "So easy!",
    "content": "What an incredible idea! Makes eating with friends better and easier. Genius",
    "rating": 5,
    "date": "2019-05-21T17:57:56-07:00"
  },
  {
    "id": "4178015855",
    "author": "Mediocre tech",
    "title": "Never works",
    "content": "The concept is awesome. Too bad the app never works. After I take a picture I get an error message that I’m not connected to the internet, even though I am.",
    "rating": 1,
    "date": "2019-05-19T17:30:58-07:00"
  },
  {
    "id": "4167400268",
    "author": "Benjamin81999372619038",
    "title": "The best",
    "content": "Life changing when going out with people and hanging out AMAZING",
    "rating": 5,
    "date": "2019-05-17T19:16:32-07:00"
  },
  {
    "id": "4145383682",
    "author": "mdweisner",
    "title": "Essential in NYC",
    "content": "This app has made going out in New York so much easier. Restaurants don't typically split bills up per person as they do in many other places so this makes it really easy to make sure everyone is paying exactly what they owe. It's more fair than just splitting it evenly between everyone and makes calculating what everyone owes with tax and tip extremely easy.",
    "rating": 5,
    "date": "2019-05-13T12:30:30-07:00"
  },
  {
    "id": "4137336323",
    "author": "Dncncub",
    "title": "Awesome!",
    "content": "Wonderful app, clearly keeps everyone honestly accountable for each item consumed by the parties participants.",
    "rating": 5,
    "date": "2019-05-11T23:03:28-07:00"
  },
  {
    "id": "4121398394",
    "author": "LeeEllenM",
    "title": "Tip added automatically not so useful",
    "content": "Four of us on a trip are getting comfortable with the app but are splitting more than restaurant bills\n\nThe tipping feature is not welcome in this case. Can we have a “zero” tip button?",
    "rating": 4,
    "date": "2019-05-08T18:30:44-07:00"
  },
  {
    "id": "4093193853",
    "author": "Danielle Pan",
    "title": "Great potential!",
    "content": "Great app but there are some features I’d love to see in the future! \n\nSplitters each with a unique color for easier organization (maybe opening up the possibility for a dark theme or choosing the color gradient in settings), splitters’ names longer than 5 characters, ability to add additional surcharges (3% health tax), itemized individual receipts that can be shared in-app via text message or other social media, compatibility with iMessage or a URL link to claim items on receipt without downloading the app (à la Jackbox games), ability to edit item list/taxes while pulling up the image of the receipt (in case the receipt has already been thrown away or lost), and saved common splitters. \n\nI’m also not too into having the camera on in the main menu without selecting New Bill. \n\nI’ve also encountered a bug where the item name is uneditable. The workaround I’ve found is Select All > Delete and then manually entering the correct item name.",
    "rating": 4,
    "date": "2019-05-03T00:31:05-07:00"
  },
  {
    "id": "4035356144",
    "author": "Wazzle19",
    "title": "So easy to use!",
    "content": "Makes sharing bill costs with friends extremely easy and simple.",
    "rating": 5,
    "date": "2019-04-19T20:47:46-07:00"
  },
  {
    "id": "4025936805",
    "author": "Toebone7",
    "title": "Perfect and convenient!",
    "content": "Super convenient and works perfectly!",
    "rating": 5,
    "date": "2019-04-17T16:28:42-07:00"
  },
  {
    "id": "4020053467",
    "author": "Person 167",
    "title": "Can I add frequent splitters?",
    "content": "Love the app, but it takes forever to re-add the same people I always have dinner with! Is there a way to have my contact list in the app saved so I can just click?",
    "rating": 4,
    "date": "2019-04-16T06:28:24-07:00"
  },
  {
    "id": "4004317989",
    "author": "MonroeArmenta",
    "title": "Exceptional App",
    "content": "This app works smoothly and exactly as advertised. Splitting bills is no longer a dreaded activity amongst our big groups.",
    "rating": 5,
    "date": "2019-04-12T13:13:54-07:00"
  },
  {
    "id": "3982680594",
    "author": "Frank0mc",
    "title": "Easy to use!",
    "content": "This app is a life savior !!!",
    "rating": 5,
    "date": "2019-04-07T08:01:09-07:00"
  },
  {
    "id": "3975392922",
    "author": "flyaway2019",
    "title": "Love this app!",
    "content": "Seriously use it all the time!",
    "rating": 5,
    "date": "2019-04-05T20:23:34-07:00"
  },
  {
    "id": "3961949541",
    "author": "SB mama 74",
    "title": "SO helpful!",
    "content": "Great app I wish I’d had this app the past 20 years! All that math-the division, subtraction, percentages-ugh! This makes going out a much more pleasant experience. Thanks!",
    "rating": 4,
    "date": "2019-04-02T17:35:41-07:00"
  },
  {
    "id": "3954033858",
    "author": "Matthew!!!!!!",
    "title": "Add Apple Pay Cash support",
    "content": "It would be pretty neat if Apple Pay/Apple Pay Cash was supported in this app for paying friends.",
    "rating": 5,
    "date": "2019-03-31T20:03:50-07:00"
  },
  {
    "id": "3951585248",
    "author": "DJR959",
    "title": "Great for groups where everyone is friends",
    "content": "Best way to fairly share a dinner bill amount at friends.",
    "rating": 5,
    "date": "2019-03-31T07:02:00-07:00"
  },
  {
    "id": "3943085477",
    "author": "LovingJesusCatholicStyle",
    "title": "Love the app, but...",
    "content": "I would REALLY love to see the ability to put in a custom tip amount rather than putting in a percentage. \n\nI usually calculate what people owe me after I’ve left dinner. So the tip is already done. And I can’t edit the tip on here to be exact, it can only be the closest percentage point.\n\nEDIT: Thanks for the tip! (No pun intended, lol) Would be awesome if the Tip field were able to be touched to edit manually, then it would totally intuitive. But otherwise, the workaround is definitely doable! Thanks again!!",
    "rating": 5,
    "date": "2019-03-29T13:28:29-07:00"
  },
  {
    "id": "3939853516",
    "author": "Flipmate",
    "title": "I’ve been looking for this for so long",
    "content": "It’s great and we use it all the time. Saves so much time trying to break up bills. Brilliant idea and execution.",
    "rating": 5,
    "date": "2019-03-28T22:08:04-07:00"
  },
  {
    "id": "3922659501",
    "author": ":@I",
    "title": "Best Bill Split App Ever",
    "content": "This app is a necessity if you find yourself constantly splitting tabs with a bunch of friends. It’s nice to not have to split the check 5 different ways since one person can pay and the rest can Venmo accordingly. Definitely download this app.",
    "rating": 5,
    "date": "2019-03-24T13:59:52-07:00"
  },
  {
    "id": "3898817508",
    "author": "cranbjuice13",
    "title": "Discount Feature Needed",
    "content": "This app is great! It worked perfectly the first time I used it. It is extremely useful, quick, and easy to use.\n\nThe second time I used it we had a 20% discount applied to our dinner. This 20% is difficult to account for, if not impossible with the Tab app. I would include an option that includes a way to apply a discount. We ended up splitting the bill evenly.",
    "rating": 4,
    "date": "2019-03-18T19:42:52-07:00"
  },
  {
    "id": "3867461225",
    "author": "AdisakP",
    "title": "Bill summary is incomplete - Otherwise Awesome",
    "content": "This is a great app for splitting bills. However, I wish the bill summary (in the My Bills history) showed the total and the tip amount rather than only the individual amounts. An option to show the photograph of the bill would be good too.\n\nAlso I wish nicknames could be more than 5 characters long.",
    "rating": 4,
    "date": "2019-03-10T17:20:24-07:00"
  },
  {
    "id": "3794319168",
    "author": "MandyKTB",
    "title": "Love Tab",
    "content": "So easy to use. Great for group meals.",
    "rating": 5,
    "date": "2019-02-20T14:04:01-07:00"
  },
  {
    "id": "3789918699",
    "author": "Blanwell",
    "title": "Magic",
    "content": "If you ever split bills with friends, just get this app. It can seriously do everything when it comes to splitting a bill, though some features are a bit hard to find.",
    "rating": 5,
    "date": "2019-02-19T10:24:55-07:00"
  },
  {
    "id": "3752775044",
    "author": "Nonickname2343",
    "title": "Awesome",
    "content": "How have I lived without this for so long!",
    "rating": 5,
    "date": "2019-02-09T21:06:05-07:00"
  },
  {
    "id": "3752292681",
    "author": "anmchan",
    "title": "Excellent app!",
    "content": "Love this app. Makes going out to eat with friends so much more enjoyable. Easy and convenient way to split bills!",
    "rating": 5,
    "date": "2019-02-09T17:56:15-07:00"
  },
  {
    "id": "3752149497",
    "author": "mc MOMO",
    "title": "so easy to use!",
    "content": "love this app. so easy to split bills.",
    "rating": 5,
    "date": "2019-02-09T16:58:38-07:00"
  },
  {
    "id": "3751611609",
    "author": "Nick Goldston",
    "title": "Are you kidding me",
    "content": "How can I possibly have gone this far in life without this app. This Is the best thing since the portable phone",
    "rating": 5,
    "date": "2019-02-09T12:58:32-07:00"
  },
  {
    "id": "3749011125",
    "author": "ckannel5",
    "title": "Well done!!!",
    "content": "The solution I didn’t know I needed",
    "rating": 5,
    "date": "2019-02-08T21:16:59-07:00"
  },
  {
    "id": "3748865681",
    "author": "robMitch1206",
    "title": "Tab App",
    "content": "GREAT APP. But there needs to be a way to split things when something is ordered unevenly between people",
    "rating": 5,
    "date": "2019-02-08T20:17:33-07:00"
  },
  {
    "id": "3715194900",
    "author": "cyan314",
    "title": "Great app but could show more transparency",
    "content": "Love how it does a good job itemizing the bill and it actually got everything correct from the picture. I just wish that on the screen where it shows the final total for each person, they would show each item and price ordered and show the tax and tips on separate lines rather than combining it into pre-tip.",
    "rating": 4,
    "date": "2019-01-30T22:17:44-07:00"
  },
  {
    "id": "3699442434",
    "author": "Mstrat5",
    "title": "Disappointing",
    "content": "Read bill but gave me new identifiable way to adjust tip. It defaulted to a 50% tip.",
    "rating": 2,
    "date": "2019-01-26T21:51:28-07:00"
  },
  {
    "id": "3686678708",
    "author": "mark_valdez",
    "title": "Stop anxiously wondering “How the hell are we going to split this?!”",
    "content": "So easy to use to split a bill evenly! Everyone plays exactly what they owe. The app makes it so easy to divide up an itemized receipt, and even adds a feature to divide a birthday person’s bill among the whole party. For those who get great points on credit card purchases, you’ll want to be the person to put your card down and have everyone Venmo you 😉",
    "rating": 5,
    "date": "2019-01-23T14:45:21-07:00"
  },
  {
    "id": "3677371362",
    "author": "jetic83",
    "title": "Extremely helpful app, but only in US!",
    "content": "Thank you so much for this amazing app! I know it from New York. But we had recently a dinner with 11 people in Arosa, CH, with unbalanced foods and drinks. I showed it to my people, but they could not use it as it was not in their app store. The app worked great also with their receipt, and just printed „USD“ instead of „CHF“. But the numbers from the check were parsed correctly. So how difficult would it be to change the currency sign, adjust the tax, connect with „paymit“ (CH variant of Venmo) and open to the Swiss app store? Thanks so much!",
    "rating": 5,
    "date": "2019-01-21T04:18:23-07:00"
  },
  {
    "id": "3654557604",
    "author": "ktw1995",
    "title": "My favorite app right now, minor change suggested",
    "content": "I absolutely love the ease that Tab provides in splitting the bill with friends. Many of my favorite restaurants don’t offer split checks, which used to cause a lot of confusion and frustration when paying the bill, but now I immediately pull up the Tab app. My friends that are unfamiliar with the app are amazed and download it right away.\n\nThe only thing I have trouble with is the Venmo sync feature. I have successfully connected my Venmo account, but can’t seem to request payment from my friends using Venmo via the Tab app. I get a message that the phone’s owner must make the request and am not able to proceed. This app easily warrants a 5 star review with this feature corrected!",
    "rating": 4,
    "date": "2019-01-15T15:58:24-07:00"
  },
  {
    "id": "3632212931",
    "author": "JayBeeSee",
    "title": "Makes Life Simpler!!",
    "content": "Love the app - I think it successfully plays its part in making one common thing much simpler. It’s easy to understand and rarely has mistakes. \nOne thing that I’d love to see fixed is the use of Venmo within the app. I can’t seem to use it because of error messages every time, stating that it needs to be on iPhone user’s account or something confusing along those lines. If Venmo can be incorporated in a much easier way, this app would be air-tight! \nLove it.",
    "rating": 5,
    "date": "2019-01-09T19:17:47-07:00"
  },
  {
    "id": "3613210672",
    "author": "kit_n_kaboodle",
    "title": "Necessary",
    "content": "This app is necessary for adulting. Splitting the check was always such a pain when going out, but now thanks to Tab we can all leave faster (and more peacefully).",
    "rating": 5,
    "date": "2019-01-04T17:56:54-07:00"
  },
  {
    "id": "3526887208",
    "author": "hocogo",
    "title": "Simple is the best",
    "content": "Ez split a bill",
    "rating": 5,
    "date": "2018-12-13T10:11:56-07:00"
  },
  {
    "id": "3521805234",
    "author": "March_COL",
    "title": "Fantastic. Very helpful!!!",
    "content": "I love this app. Easy to use.",
    "rating": 5,
    "date": "2018-12-12T00:26:34-07:00"
  },
  {
    "id": "3494264489",
    "author": "JNT001",
    "title": "Great App!",
    "content": "Finally an app that does what I wanted.  Very simple to use.  There is one thing that it does not do though and I hope you can add it as an update.  Sometime I like to share an appetizer with another person in my party.  Can you make it split the price of an item?",
    "rating": 4,
    "date": "2018-12-04T17:49:55-07:00"
  },
  {
    "id": "3487912032",
    "author": "lufreddy",
    "title": "Confusing tag method, cant modify check after is saved",
    "content": "Simple but close tight to make changes, confusing method to tag members",
    "rating": 1,
    "date": "2018-12-02T22:40:06-07:00"
  },
  {
    "id": "3475723126",
    "author": "Iram Zetineb",
    "title": "App is glitchy",
    "content": "New: Their response team has been absolutely wonderful and super communicative, we figured it out and I’m super happy with the app again. Went from 3 stars back to 5 stars, super impressed that they reached and wanted to figure this out together. thank you guys soooooo much!!\n\nOld:\nThe last two times ive used this, the was completely inaccurate, the subtotal was nearly double the bill but the split was somewhat evened up - it was off by $4-5 which doesnt sound like alot but it is when you are the one paying the difference after everyone had already paid and its happened more than once. Please fix!🙏🙏🙏",
    "rating": 5,
    "date": "2018-11-29T19:05:11-07:00"
  },
  {
    "id": "3426186178",
    "author": "Alex2a",
    "title": "Brilliant for Splitting Bills",
    "content": "Super easy to use. Worth a shot! Connects directly to Venmo so you can pay via Venmo from within Tab. \n\nWay easier than manually charging individual people in Venmo.",
    "rating": 5,
    "date": "2018-11-16T17:13:11-07:00"
  },
  {
    "id": "3409839722",
    "author": "Ricki234",
    "title": "Tip",
    "content": "Really useful but the “included tip” part is always off and it’s confusing. It’d be good if that part is editable",
    "rating": 4,
    "date": "2018-11-12T05:40:28-07:00"
  },
  {
    "id": "3355224833",
    "author": "Princessflip0321",
    "title": "Love it!",
    "content": "Don’t know why more people know about this app! So great for big group meals! Makes it fair for everyone and so easy to use.",
    "rating": 5,
    "date": "2018-10-28T14:13:02-07:00"
  },
  {
    "id": "3355115300",
    "author": "bige2035r",
    "title": "My Favorite App and Here’s Why!",
    "content": "My friends make fun of me because any chance I get, I pitch Tab to everyone who will listen. I used to have so much anxiety before going out to dinner with friends because I dread the uncertainty of how to split the bill. Now with Tab, I’m the first person to offer to Tab it and perfectly split the bill fairly every time. Thank you so much, developers, for making this great app and seriously improving a pain point I’ve had for so long! If you live in a place that refuses to split your checks, get Tab and seriously never worry about it again.",
    "rating": 5,
    "date": "2018-10-28T13:26:27-07:00"
  },
  {
    "id": "3350979746",
    "author": "Bugmeister96",
    "title": "so awesome!",
    "content": "this makes my life so much easier!! honestly i love this\n\nthe only thing i would like is if they wouldn’t do automatic tax \n\nyou can even input your own information for the check! it’s so great",
    "rating": 5,
    "date": "2018-10-27T11:59:50-07:00"
  },
  {
    "id": "3324737746",
    "author": "frimmycake",
    "title": "My. God. It works.",
    "content": "Works like magic",
    "rating": 5,
    "date": "2018-10-20T15:44:55-07:00"
  },
  {
    "id": "3241413919",
    "author": "Nathaniel Camillo",
    "title": "Faulty",
    "content": "I’ve tried using this app three times. It has the right idea, but does not execute. What works, taking photos of receipts and accuracy. What doesn’t: when I total the tab, tip, and tax, the total is not correct. I’ve redownloaded the app as well as had a friend try the receipts. Still an incorrect total. Unfortunate.",
    "rating": 1,
    "date": "2018-09-28T16:33:00-07:00"
  },
  {
    "id": "3219884917",
    "author": "angryatcoinbase",
    "title": "Wow - Great Experience",
    "content": "Great job ! Just used the app for the first time. Smooth, efficient, cool! Jee Wizz what an app !",
    "rating": 5,
    "date": "2018-09-22T21:43:13-07:00"
  },
  {
    "id": "3175538349",
    "author": "bwivey",
    "title": "Amazing App",
    "content": "You need this app, trust me!",
    "rating": 5,
    "date": "2018-09-10T11:08:18-07:00"
  },
  {
    "id": "3097950430",
    "author": "JEM jill higfbjgf",
    "title": "Super easy to use!",
    "content": "This app is amazing for splitting up checks. I love using it when we have to divide a check for a large group. You take a picture and it loads everything from the receipt into an easy to see list. It even make it easy to share items between people.",
    "rating": 5,
    "date": "2018-08-21T23:30:45-07:00"
  },
  {
    "id": "3079727038",
    "author": "Brisnyc7",
    "title": "Brilliant free app",
    "content": "Just used it for the first time a few days ago and it was so easy to split the bill. All my friends downloaded the app as well after they saw how great it was. Saved us such a headache working things out manually. So fun to highlight everything. Thanks!!\n\nMoving back to Australia soon, hoping it's going to work there too!!",
    "rating": 5,
    "date": "2018-08-17T19:24:41-07:00"
  },
  {
    "id": "3002055289",
    "author": "J-drums",
    "title": "Most useful app ever",
    "content": "This app is smooth, straightforward, and makes something that used to be a headache a no-brainer. Perfect!",
    "rating": 5,
    "date": "2018-08-01T09:49:42-07:00"
  },
  {
    "id": "2945937577",
    "author": "Apai314",
    "title": "Best bill splitting app",
    "content": "I’ve been using this app for... god knows how many years and it’s by far the best, simplest, bill splitting app out there. ❤️",
    "rating": 5,
    "date": "2018-07-21T13:20:01-07:00"
  },
  {
    "id": "2936671801",
    "author": "mikemcnally123xoxo",
    "title": "BEST APP EVAAAAA",
    "content": "i would equate the happiness i felt the moment i used Tab to the moment i give birth to my first born child. you seriously cannot go wrong",
    "rating": 5,
    "date": "2018-07-19T17:50:19-07:00"
  },
  {
    "id": "2911128479",
    "author": "ialexryan",
    "title": "AWFUL UPDATE - deletes your data unless you give them your email!",
    "content": "For years, Tab has saved bills locally once you’re done with them. I rely on that to do the math while I’m still at the table, then have people send me money later.\n\nThe developers have CHANGED the behavior, with no notice. Bills are now DELETED once you leave the app, unless you sign up for a totally unnecessary account with them. The app still has the technical ability to save bills locally of course, and iCloud can sync and backup app data, but they have to find some leverage to get us to give them our email addresses so they can sell them or monetize us somehow.\n\nI’m at least accustomed to that kind of selling-out by app developers at this point. But what I cannot abide is lacking the common decency to TELL your users what you’re doing. I relied on behavior that’s been consistent for years to save ten minutes of unpleasant manual entry work, and you tossed it in the trash with no warning, for no other reason than to strongarm me into signing up for another account I don’t need. Shame on you.",
    "rating": 1,
    "date": "2018-07-15T02:02:14-07:00"
  },
  {
    "id": "2887747739",
    "author": "QueenBHart",
    "title": "My favorite app",
    "content": "Makes dinners out with friends so much easier. Love this!!",
    "rating": 5,
    "date": "2018-07-11T16:30:30-07:00"
  },
  {
    "id": "2865346812",
    "author": "Asher1125",
    "title": "Must get",
    "content": "Amazing UI. 10/10 would recommend",
    "rating": 5,
    "date": "2018-07-08T11:20:55-07:00"
  },
  {
    "id": "2738801885",
    "author": "KJF-DC",
    "title": "Wow",
    "content": "Had a chance to test this app yesterday after the fact. My old-fashioned mental calculation was confirmed, to the penny, by the app and much more quickly.",
    "rating": 5,
    "date": "2018-06-21T06:44:46-07:00"
  },
  {
    "id": "2729012626",
    "author": "Shealewwy",
    "title": "Amazing App",
    "content": "I had this idea tonight while I was with friends. As a designer and product developer, I couldn’t do this better myself. Good work guys!! Grandma everything so well and makes life way easier. \n\nOnly tip for design would be to separate the section where it says the person that already claimed item. This should be a different color or more bold so it’s easier to tell what’s already been claimed on the tab! But other than that, you have a fan! Now I don’t have to stress about splitting the bill anymore. Good work guys!",
    "rating": 5,
    "date": "2018-06-19T22:10:51-07:00"
  },
  {
    "id": "2720422273",
    "author": "SillyRabbitTrix",
    "title": "Taxes don’t show??",
    "content": "I have tried using tab for the first time in over a month.  The items purchased are showing up, but sales taxes are not.  Very frustrating.  I don’t see a way to manually add in sales taxes.  Please fix.",
    "rating": 4,
    "date": "2018-06-18T14:21:46-07:00"
  },
  {
    "id": "2697005185",
    "author": "gl&s",
    "title": "Absolutely fantastic",
    "content": "This app works beautifully.  I wish I had this 10 years ago.  Completely solves the check splitting problem.  Unlike years ago, many restaurants will provide separate bills.  Even so, it may be better to get one tab and use the app—you have more control.",
    "rating": 5,
    "date": "2018-06-14T22:02:05-07:00"
  },
  {
    "id": "2651359151",
    "author": "urbanizedanimal",
    "title": "Great app, but minor bug",
    "content": "It’s a great app and makes bill splitting much less of a headache. However, I’m on an iPhone X and I’m unable to scroll through the summary of names when viewing a past bill.\n\nEdited:\nThanks for fixing that bug, Tab developers! I have another feature request. Currently, if I want to add an additional tip on top of an included tip, Tab only allows me to add a percentage tip. I would like the ability to add a numeric tip as well",
    "rating": 4,
    "date": "2018-06-06T09:35:19-07:00"
  },
  {
    "id": "2628728717",
    "author": "jqhauhwhahwhjanwjwbvwv",
    "title": "Greatest app I’ve ever used",
    "content": "Amazing",
    "rating": 5,
    "date": "2018-06-01T16:54:49-07:00"
  },
  {
    "id": "2604228115",
    "author": "Ssteinert",
    "title": "Best App On My Phone",
    "content": "I use Tab every time I go out to eat with friends. I have been using Tab for a few years now and it makes dividing up the food bill almost effortless!",
    "rating": 5,
    "date": "2018-05-27T11:06:20-07:00"
  },
  {
    "id": "2560517830",
    "author": "Jon_bee",
    "title": "AMAZING LIFE SAVER",
    "content": "This is SUCH A GREAT APP for groups!  It splits everything PERFECTLY, so no one walks away having paid a cent less or more than they owe, including tax and down to personalized percentages for tips!  You can also split one person’s meal between the rest of the group if it’s a special celebration for that person.  LOVE IT!",
    "rating": 5,
    "date": "2018-05-17T13:20:31-07:00"
  },
  {
    "id": "2539509269",
    "author": "TIMEEW",
    "title": "Flawless",
    "content": "No mistakes so far! It’s great",
    "rating": 5,
    "date": "2018-05-12T19:26:19-07:00"
  },
  {
    "id": "2538433414",
    "author": "<(mah!)>",
    "title": "Awesome app",
    "content": "Great app to split check, tips and taxes.\nI recommend this app to everyone:)",
    "rating": 5,
    "date": "2018-05-12T12:55:58-07:00"
  },
  {
    "id": "2529879859",
    "author": "Stayclassics",
    "title": "Has potential to be a must have app by falls short",
    "content": "It’s a great app to organize a check. I’m usually the guy in my group that Venmo everyone their portion of the check. This app made it super easy to split it by pressing the items. The part that’s missing is that, there is no way to request a person their portion of the check. They have to all download the app and choose themselves. This is a bit impractical when you have a large group and possible friends that don’t want to download the app or people you don’t know well. It would be so much better if you can send requests via Venmo since it already integrates with it.",
    "rating": 3,
    "date": "2018-05-10T15:29:00-07:00"
  },
  {
    "id": "2468464415",
    "author": "EmKolps",
    "title": "So Amazing",
    "content": "I love this app an abnormal amount. It makes splitting dishes way less taboo and completely acceptable because it’s fun!!! Thank you for the work put into this app, my friends and I really love it.",
    "rating": 5,
    "date": "2018-04-25T19:00:00-07:00"
  },
  {
    "id": "2450398076",
    "author": "ChicagoSpencer",
    "title": "So convenient",
    "content": "This app is super smart and super easy to use! Makes splitting a complicated bill really convenient. There is also an option for birthdays so everyone else can split one persons check! Love this app!",
    "rating": 5,
    "date": "2018-04-21T09:49:55-07:00"
  },
  {
    "id": "2439704815",
    "author": "Khalilramah",
    "title": "Great App, simple to use but ...",
    "content": "After splitting the bills, one should be able to verify the items they took on their respective tabs. Like a breakdown of their total and not just the general total. \n\nAlso people should be able to individually decide how much they’re willing to tip on their respective tabs. \n\nOne more thing, sharing bills and breakdowns to other apps for people who don’t have or can’t have Tabs installed.",
    "rating": 4,
    "date": "2018-04-18T23:06:05-07:00"
  },
  {
    "id": "2438449046",
    "author": "lkd412",
    "title": "Expiring bills is a major flaw!",
    "content": "Why do bills need to expire after an hour? When charging friends for bills from yesterday (or from a recent trip), it would be nice for them to have more than an hour to access the bills.  Otherwise, the makings of a good app so far.",
    "rating": 3,
    "date": "2018-04-18T14:55:55-07:00"
  },
  {
    "id": "2435112268",
    "author": "daniellebeverly",
    "title": "Works better than any other!",
    "content": "Quick, intuitive, and efficient! What more could you ask for when you’re trying to wrangle everyone to pay after several mimosas? Thanks, Tab!",
    "rating": 5,
    "date": "2018-04-17T18:27:43-07:00"
  },
  {
    "id": "2423547357",
    "author": "Lyftrida",
    "title": "Request Payment from Venmo",
    "content": "I wish there was an option to request payment from someone via Venmo through the app. There is the option to pay someone, but in most cases the person using Tab is the one who paid and now needs to divide everything and request it from everyone else. There should also be a custom tip. I know there’s “included tip” but that’s not really the same.",
    "rating": 3,
    "date": "2018-04-14T16:44:38-07:00"
  },
  {
    "id": "2396095748",
    "author": "FreePaulWall",
    "title": "Solid",
    "content": "Solid",
    "rating": 5,
    "date": "2018-04-07T16:49:30-07:00"
  },
  {
    "id": "2379500738",
    "author": "Madammoore",
    "title": "Huge timesaver!",
    "content": "I absolutely adore this app! It takes me a few minutes to do the check at dinner and then get back to socializing. Thank you so much! By the way, if you ever need someone to test a future release I’d be happy to be your guinea pig.",
    "rating": 5,
    "date": "2018-04-03T10:04:39-07:00"
  },
  {
    "id": "2320069169",
    "author": "KEITH WAHOOOOO",
    "title": "Love this! Super convenient!!",
    "content": "Love this! Super convenient!!!",
    "rating": 5,
    "date": "2018-03-18T09:11:46-07:00"
  },
  {
    "id": "2314168797",
    "author": "Kelibrarian",
    "title": "Lifesaver!",
    "content": "Oh, how I love this app! Works beautifully, integrates with Venmo, intuitive, WONDERFUL!",
    "rating": 5,
    "date": "2018-03-16T19:31:46-07:00"
  },
  {
    "id": "2306760768",
    "author": "re_gardless",
    "title": "Fantastic app!!",
    "content": "Great app",
    "rating": 5,
    "date": "2018-03-14T17:44:49-07:00"
  },
  {
    "id": "2271647979",
    "author": "Mnbvjyfpjxrtm",
    "title": "Great app",
    "content": "Best invention since the napkin!  So easy to use and always accurate.",
    "rating": 5,
    "date": "2018-03-04T16:06:48-07:00"
  },
  {
    "id": "2266731325",
    "author": "lmarms",
    "title": "Awesome app!",
    "content": "Cannot say enough great things about this app!! Use it every time we eat out as a group, makes life so much easier.",
    "rating": 5,
    "date": "2018-03-03T07:14:35-07:00"
  },
  {
    "id": "2261757451",
    "author": "K19845",
    "title": "Love It!",
    "content": "This is a great app. One suggestion I have is to be able to edit a person’s name or have the ability to remove them all together. Other than that, this app is exactly what I’ve been needing!  I will use this all the time now. At large dinners it was always a hassle to split bills and people would get charged equally for tip and tax but always felt it was unfair to get charged the same tip and tax rate when they got a cheaper meal - so this app solves that problem for me!",
    "rating": 5,
    "date": "2018-03-01T22:54:57-07:00"
  },
  {
    "id": "2253616817",
    "author": "pdk_spamela",
    "title": "Good, could be great",
    "content": "I recently used this app for the first time and was able to split a bill between seven people fairly easily and give them their total. I had a question come up later but could not get back to the details to verify that we had split the bill correctly, adding some audit trail would be really useful in this situation. Additionally, another great feature would be to be able to send out, via text or email, an itemized receipt to each of the bill participants. The people I regularly split large bills with have a wide range of comfort with technology, it would be nice to be able to send them something more detailed than just their totals but show them the items selected and their portion of taxes and tip. Asking them to join the bill from their device is way beyond what they would be willing to do. With these two enhancements, this would be the perfect app for my needs.",
    "rating": 4,
    "date": "2018-02-27T12:42:27-07:00"
  },
  {
    "id": "2248076014",
    "author": "Garage sunset",
    "title": "Not accurate",
    "content": "I was so excited to use this app, but we also had to break out the pen and part. Great concept but not accurate. The tax was also double the amount of the bill?? Our bill was like $240 and tax came out as $230 and I wasn’t able to edit it. So everyone abandoned the AP and resorted back to traditional methods to sort out the bill... bummer! Was a brilliant concept!",
    "rating": 2,
    "date": "2018-02-25T20:33:54-07:00"
  },
  {
    "id": "2240506375",
    "author": "Venma Bojoh",
    "title": "THE BESTEST",
    "content": "Seriously. This app is amazing. Revolutionary.",
    "rating": 5,
    "date": "2018-02-23T17:55:44-07:00"
  },
  {
    "id": "2238183779",
    "author": "NessaWilli",
    "title": "Still Great!",
    "content": "I'm glad you guys are making improvements. I've been using for years and it's still the only app I can take a photo and split the bill with. It was buggy and missed some things on the receipts but I'm glad youre working to improve.",
    "rating": 4,
    "date": "2018-02-23T02:08:18-07:00"
  },
  {
    "id": "2195115667",
    "author": "Boat Carpenter",
    "title": "Good ocr , intuitive operation",
    "content": "Does a nice job of scanning the bill, makes it easy to split both total & tip. I particularly liked how it allows you to split a person’s bill among the rest of the party (e.g., for a birthday outing).",
    "rating": 5,
    "date": "2018-02-11T04:52:36-07:00"
  },
  {
    "id": "2192417126",
    "author": "estebanesteban2",
    "title": "You lose itemized details after done",
    "content": "Once you’re done with a tab, you can’t view the itemized details. It’s just gives you an overview per person (up to 5). If you have more than 5 people you will not see the extra details, and you’re not able to make edits to the tab. \n\nThe rest of the experience is great. Too bad it’s just half way good.",
    "rating": 2,
    "date": "2018-02-10T13:02:04-07:00"
  },
  {
    "id": "2167277883",
    "author": "Tal Richtman",
    "title": "App of the year",
    "content": "So convenient! Takes out the awkwardness  at the end of every meal.",
    "rating": 5,
    "date": "2018-02-04T10:20:49-07:00"
  },
  {
    "id": "2164885928",
    "author": "Oljato99",
    "title": "Bummed out",
    "content": "I like this app, but when the tip is included it did not divide the totals appropriately.",
    "rating": 2,
    "date": "2018-02-03T21:34:10-07:00"
  },
  {
    "id": "2159161121",
    "author": "Gurflob",
    "title": "Responsive developers",
    "content": "After having used this app quite a lot, I realized that the only complaint I had with it was the lack of conclusion screen that shows all the person/bill-total pairs in the same screen. I reached out to customer support and they replied very quickly and updated me on plans to incorporate this feature in the future. I appreciate how the developers continue to iterate on the design to meet users needs.",
    "rating": 5,
    "date": "2018-02-02T11:43:13-07:00"
  },
  {
    "id": "2102601268",
    "author": "Scooterlicious1",
    "title": "Bar math is hard",
    "content": "This is an amazing app for dealing with the annoyance of group outings and single checks. Honestly I don’t know why restaurants don’t have this system fully integrated already. I have to say that at least on one occasion it incorrectly calculated the the portioned amounts and we ended up giving the server an outrageous tip.",
    "rating": 5,
    "date": "2018-01-18T15:25:57-07:00"
  },
  {
    "id": "2061402209",
    "author": "MikeMoon1776",
    "title": "Love it!",
    "content": "Love this app!",
    "rating": 5,
    "date": "2018-01-05T20:58:54-07:00"
  },
  {
    "id": "2060262856",
    "author": "Clai",
    "title": "Game changer",
    "content": "I no longer need to look at my Chinese friends every time the bill comes. Thanks Tab!",
    "rating": 5,
    "date": "2018-01-05T12:19:53-07:00"
  },
  {
    "id": "2058987941",
    "author": "Malibu3105",
    "title": "Love this app!!!",
    "content": "First, this developer listens and responds. Second, new features are coming.  \nI use this anytime I am out spending with friends. Just take a picture of the receipt and split it up.\nVery easy, and the fact that others can join the bill from their devices is awesome. Even has Venmo option.\nI’m willing to pay for more features :)\nThanks for developing this!!",
    "rating": 5,
    "date": "2018-01-05T03:24:39-07:00"
  },
  {
    "id": "2054438164",
    "author": "Ing. Israel",
    "title": "Great!",
    "content": "Excelent app.",
    "rating": 5,
    "date": "2018-01-03T15:53:24-07:00"
  },
  {
    "id": "2036952081",
    "author": "J35667843678",
    "title": "Love this app!",
    "content": "My friends hand me the bill immediately every time we go out because they know I will have fun using this app and it will be accurate. A life saver at the group dinner!!",
    "rating": 5,
    "date": "2017-12-28T20:33:24-07:00"
  }
]